2018/python2.5-2.7.org
#+OPTIONS:    H:3 num:nil toc:t \n:nil ::t |:t ^:nil -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+TITLE:      Python2.5-2.7的版本变化
#+AUTHOR:     rgb-24bit
#+EMAIL:      rgb-24bit@foxmail.com
#+DATE:       <2018-01-23 周二>

* 前言
  在学习 =Python= 之前就纠结过到底是先学 =Python2= 好还是先学 =Python3= 好.

  后来, 考虑了一下, 决定先学 =Python2=, 这时我选择的教材是 《Python基础教程》.

  这本书在网上评价很好, 同时也让我受益匪浅, 但是唯一的缺陷是, 这本书讲解的 =Python版本=
  是 =Python2.5=, 而目前主流的 =Python版本= 是 =2.7=, 和 =3.6=.

  所以为了进一步了解和学习 =Python=, 我决定通过官方文档来了解 =2.5->2.7= 这几个版本的
  变化. (=3.x= 的留待以后)

* Python2.5
  虽然 《Python基础教程》 讲解的便是 =Python2.5=, 但我还是感觉有必要来了解一下
  =2.5= 版本的内容.

