2018/python2.5-2.7.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-08-12 周日 11:30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python2.5-2.7的版本变化</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/org-html-theme-list/org-note/style/main.css"/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python2.5-2.7的版本变化</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge45469d">1. 前言</a></li>
<li><a href="#org91d4f1a">2. Python2.5</a>
<ul>
<li><a href="#org568369c">2.1. 主要语言变化</a></li>
<li><a href="#org2e74a6f">2.2. 核心语言变化</a></li>
<li><a href="#org0ab5b5f">2.3. 其他内容</a></li>
</ul>
</li>
<li><a href="#org13498cd">3. Python2.6</a>
<ul>
<li><a href="#org7527652">3.1. 主要语言变化</a></li>
<li><a href="#org953413f">3.2. 核心语言变化</a></li>
<li><a href="#orgdaa8020">3.3. 其他内容</a></li>
</ul>
</li>
<li><a href="#org4813c6e">4. Python2.7</a>
<ul>
<li><a href="#orgc067496">4.1. 主要变化之前</a></li>
<li><a href="#org2724c91">4.2. 主要语言变化</a></li>
<li><a href="#org94a9490">4.3. 核心语言变化</a></li>
<li><a href="#org1fdd805">4.4. 其他内容</a></li>
</ul>
</li>
<li><a href="#org4ae392a">5. 完结感言</a></li>
<li><a href="#orgbb2bfbc">6. 相关链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge45469d" class="outline-2">
<h2 id="orge45469d"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
在学习 <code>Python</code> 之前就纠结过到底是先学 <code>Python2</code> 好还是先学 <code>Python3</code> 好.
</p>

<p>
后来, 考虑了一下, 决定先学 <code>Python2</code>, 这时我选择的教材是 《Python基础教程》.
</p>

<p>
这本书在网上评价很好, 同时也让我受益匪浅, 但是唯一的缺陷是, 这本书讲解的 <code>Python版本</code>
是 <code>Python2.5</code>, 而目前主流的 <code>Python版本</code> 是 <code>2.7</code>, 和 <code>3.6</code>.
</p>

<p>
所以为了进一步了解和学习 <code>Python</code>, 我决定通过官方文档来了解 <code>2.5-&gt;2.7</code> 这几个版本的
变化. (<code>3.x</code> 的留待以后)
</p>
</div>
</div>

<div id="outline-container-org91d4f1a" class="outline-2">
<h2 id="org91d4f1a"><span class="section-number-2">2</span> Python2.5</h2>
<div class="outline-text-2" id="text-2">
<p>
虽然 《Python基础教程》 讲解的便是 <code>Python2.5</code>, 但我还是感觉有必要来了解一下
<code>2.5</code> 版本的内容.
</p>
</div>
