2018/python2.5-2.7.org
** 主要语言变化
   =2.5= 对比 =2.4= 有了这些变化.

   1. *Conditional Expressions*

      即条件表达式, 从众多选择中脱颖而出的是这样的: =x = true_value if condition else false_value=
      (编辑文档的作者貌似对这一选择感到惊讶)
      
      这里有两种书写方式:

      #+BEGIN_SRC python
        # First version -- no parens
        level = 1 if logging else 0

        # Second version -- with parens
        level = (1 if logging else 0)
      #+END_SRC

      第二种貌似要清楚一些 ?

   2. *Partial Function Application*
      
      这个功能包含在 =functools= 模块中. 这个模块有个函数 =partial()=.

      =partial()= 的使用方式为: =partial(function, arg1, arg2, ... kwarg1=value1, kwarg2=value2)=

      示例代码:

      #+BEGIN_SRC python
        import functools

        def log (message, subsystem):
            "Write the contents of 'message' to the specified subsystem."
            print '%s: %s' % (subsystem, message)
            ...

        server_log = functools.partial(log, subsystem='server')
        server_log('Unable to open socket')
      #+END_SRC

      个人理解: 这个功能允许通过现有的函数来构造一个具有该函数部分功能的新函数.
      构造新函数时, 指定 =旧函数参数的值=, 使得新函数使用时不需要在手动传入 =指定的参数=.
      
   3. *Metadata for Python Software Packages*
      
      =setup()= 函数新增了 =requires=, =provides=, =obsoletes= 关键字参数.
      使用 =sdist= 命令构建你的包的时候, 依赖信息会保存在 =PKG-INFO= 中.

      还有一个关键字参数 =download_url=, 用于设置包的 =源码= 链接.

      more...
   
   4. *Absolute and Relative Imports*
      
      相对和绝对导入.

      假设有这样一个目录:

      #+BEGIN_EXAMPLE
        pkg/
        pkg/__init__.py
        pkg/main.py
        pkg/string.py
      #+END_EXAMPLE

      你可以这样导入模块:

      #+BEGIN_SRC python
        # Import names from pkg.string
        from .string import name1, name2
        # Import pkg.string
        from . import string
      #+END_SRC

      这在 =2.7= 版本中已经是默认特性了, 但是在 =2.5= 中使用还需要:
      : from __future__ import absolute_import

   5. *Executing Modules as Scripts*
      
      =python -m module=, =-m= 参数的由来
      
   6. *Unified try/except/finally*
      
      直到 =2.5= 版本, =try= 才可以同时使用: =except=, =finally=.

      即, 你可以这样写了:

      #+BEGIN_SRC python
        try:
            block-1 ...
        except Exception1:
            handler-1 ...
        except Exception2:
            handler-2 ...
        else:
            else-block
        finally:
            final-block
      #+END_SRC

      =2.5= 以前不行, 貌似这是 =Python= 的作者从 =Java= 获取的灵感.

   7. *New Generator Features*
      
      =2.5= 版本对 =yield= 进行了一些修改, 使得它可以返回值了(之前不可以)

      于是, 我们的生成器便成了这样:

      #+BEGIN_SRC python
        def counter (maximum):
            i = 0
            while i < maximum:
                yield i
                i += 1
      #+END_SRC

      对现在的我们来说, =yield= 似乎就是一个这样, 所以这里就不多讲了.

   8. *The ‘with’ statement*
      
      =2.5= 版本新增了 =with= 结构, 你可以这样使用它:

      #+BEGIN_SRC python
        with expression [as variable]:
            with-block
      #+END_SRC

      这里的 =expression= 返回的结果应该是一个上下文对象, 即这个对象至少包含:
      =__enter__()=  和 =__exit__()= 方法.

      =__enter__()= 在 =with-block= 代码块之前调用, =__exit__()= 在 =with-block=
      代码块执行完成后调用.

      当然, 如果你要使用这个功能在 =2.5= 版本, 你还需要这样的代码:
      : from __future__ import with_statement
      
      * *Writing Context Managers*
        
        如果你要自己便写一个上下文对象, 需要注意以下细节:

        - 表达式返回的对象应该是一个上下文对象, 这个对象至少包含有: =__enter__()=
          和 =__exit__()= 方法.

        - 上下文对象的 =__enter__()= 方法被调用, 返回值被分配给 =as variable= 指定的值.
          如果没有指定值, 那么值将会被简单的丢弃.

        - 代码块将被执行

        - 如果代码块抛出一个异常, 那么 =__exit__(type, value, traceback)= 将被执行.

        - 如果代码块没有抛出异常, 那么 =__exit__()= 仍然会执行, 只不过 =type=, =value=, =traceback= 都将是 =None=

        这里是一个例子:

        #+BEGIN_SRC python
          # 假设我们定义了一个名为 DatabaseConnection 的上下文对象
          db_connection = DatabaseConnection()
          with db_connection as cursor:
              cursor.execute('insert into ...')
              cursor.execute('delete from ...')
              # ... more operations ...

          # 这个上下文对象的基本方法有
          class DatabaseConnection:
              # Database interface
              def cursor (self):
                  "Returns a cursor object and starts a new transaction"
              def commit (self):
                  "Commits current transaction"
              def rollback (self):
                  "Rolls back current transaction"

          # 现在定义它的 __enter__() 方法
          class DatabaseConnection:
              ...
              def __enter__ (self):
                  # Code to start a new transaction
                  cursor = self.cursor()
                  return cursor

          # 现在定义它的 __exit__() 方法
          class DatabaseConnection:
              ...
              def __exit__ (self, type, value, tb):
                  if tb is None:
                      # No exception, so commit
                      self.commit()
                  else:
                      # Exception occurred, so rollback.
                      self.rollback()
                      # return False
        #+END_SRC

      * *The contextlib module*
        
        =2.5= 版本的一个新模块 =contextlib= 提供了一些 *函数* 和 一个 *装饰器*.
        这些函数和装饰器对便写一个上下文对象很有帮助.

        这个装饰器是: =contextmanager()=. 这个装饰器允许让你编写一个 *生成器* 来而不是编写一个 *类.*

        你编写的 *生成器* 应该只返回 *一个值*.

        这个生成器的 *yield* 将会被当做 =__enter__()= 方法执行. 而 *yield* 之后的代码将会当做 =__exit__()= 方法执行.

        代码示例:

        #+BEGIN_SRC python
          from contextlib import contextmanager

          @contextmanager
          def db_transaction (connection):
              cursor = connection.cursor()
              try:
                  yield cursor
              except:
                  connection.rollback()
                  raise
              else:
                  connection.commit()

          db = DatabaseConnection()
          with db_transaction(db) as cursor:
              ...
        #+END_SRC

        另外, =contextlib= 模块包含了 =nested(mgr1, mgr2, ...)= 和 =closing(object)= 函数.
        
        =nested= 允许你同时结合 *多个* 上下文管理器(而不是编写嵌套的 *with*).
        
        而 =closing(object)= 返回 =object=, 所以可以被绑定到一个变量上. 并且在代码块执行完后会调用
        =object.close= 方法.

        使用例:

        #+BEGIN_SRC python
          # nested
          lock = threading.Lock()
          with nested (db_transaction(db), lock) as (cursor, locked):
              ...

          # closing
          with closing(urllib.urlopen('http://www.yahoo.com')) as f:
              for line in f:
                  sys.stdout.write(line)
        #+END_SRC

   9. *Exceptions as New-Style Classes*

      =2.5= 版本的异常的继承层次被重新安排了一下， 现在是这样的:

      #+BEGIN_EXAMPLE
        BaseException       # New in Python 2.5
        |- KeyboardInterrupt
        |- SystemExit
        |- Exception
           |- (all other current built-in exceptions)
      #+END_EXAMPLE

      所以现在可以使用: =except:= 来捕获 *所有的* 异常了(以前的版本啥样的...)

   10. *Using ssize_t as the index type*

       这个是针对 =Python's C API= 的, 使用一个新的类型 =Py_ssize_t= 来替代 =int=.
       好方便 =Python= 在 =64= 位机上处理更多的数据, 而不影响 =32= 位机.

       嗯... 没感觉

   11. *The ‘__index__’ method*
       
       =2.5= 版本添加了 =__index__()= 方法, 这个方法不接受参数并且返回一个整型的数字, 
       用于分片索引的使用.

       #+BEGIN_SRC python
         class C:
             def __index__ (self):
                 return self.value
       #+END_SRC

       值得注意的是, 这个返回值的类型必须是一个 python 整型/长整型, 否则会出现 =TypeError= 错误.

