2018/python2.5-2.7.html

<div id="outline-container-org568369c" class="outline-3">
<h3 id="org568369c"><span class="section-number-3">2.1</span> 主要语言变化</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>2.5</code> 对比 <code>2.4</code> 有了这些变化.
</p>

<ol class="org-ol">
<li><p>
<b>Conditional Expressions</b>
</p>

<p>
即条件表达式, 从众多选择中脱颖而出的是这样的: <code>x = true_value if condition else false_value</code>
(编辑文档的作者貌似对这一选择感到惊讶)
</p>

<p>
这里有两种书写方式:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">First version -- no parens</span>
<span style="font-weight: bold; font-style: italic;">level</span> = 1 <span style="font-weight: bold;">if</span> logging <span style="font-weight: bold;">else</span> 0

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Second version -- with parens</span>
<span style="font-weight: bold; font-style: italic;">level</span> = (1 <span style="font-weight: bold;">if</span> logging <span style="font-weight: bold;">else</span> 0)
</pre>
</div>

<p>
第二种貌似要清楚一些 ?
</p></li>

<li><p>
<b>Partial Function Application</b>
</p>

<p>
这个功能包含在 <code>functools</code> 模块中. 这个模块有个函数 <code>partial()</code>.
</p>

<p>
<code>partial()</code> 的使用方式为: <code>partial(function, arg1, arg2, ... kwarg1=value1, kwarg2=value2)</code>
</p>

<p>
示例代码:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> functools

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">log</span> (message, subsystem):
    <span style="font-style: italic;">"Write the contents of 'message' to the specified subsystem."</span>
    <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'%s: %s'</span> % (subsystem, message)
    ...

<span style="font-weight: bold; font-style: italic;">server_log</span> = functools.partial(log, subsystem=<span style="font-style: italic;">'server'</span>)
server_log(<span style="font-style: italic;">'Unable to open socket'</span>)
</pre>
</div>

<p>
个人理解: 这个功能允许通过现有的函数来构造一个具有该函数部分功能的新函数.
构造新函数时, 指定 <code>旧函数参数的值</code>, 使得新函数使用时不需要在手动传入 <code>指定的参数</code>.
</p></li>

<li><p>
<b>Metadata for Python Software Packages</b>
</p>

<p>
<code>setup()</code> 函数新增了 <code>requires</code>, <code>provides</code>, <code>obsoletes</code> 关键字参数.
使用 <code>sdist</code> 命令构建你的包的时候, 依赖信息会保存在 <code>PKG-INFO</code> 中.
</p>

<p>
还有一个关键字参数 <code>download_url</code>, 用于设置包的 <code>源码</code> 链接.
</p>

<p>
more&#x2026;
</p></li>

<li><p>
<b>Absolute and Relative Imports</b>
</p>

<p>
相对和绝对导入.
</p>

<p>
假设有这样一个目录:
</p>

<pre class="example">
pkg/
pkg/__init__.py
pkg/main.py
pkg/string.py
</pre>

<p>
你可以这样导入模块:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Import names from pkg.string</span>
<span style="font-weight: bold;">from</span> .string <span style="font-weight: bold;">import</span> name1, name2
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Import pkg.string</span>
<span style="font-weight: bold;">from</span> . <span style="font-weight: bold;">import</span> string
</pre>
</div>

<p>
这在 <code>2.7</code> 版本中已经是默认特性了, 但是在 <code>2.5</code> 中使用还需要:
</p>
<pre class="example">
from __future__ import absolute_import

</pre></li>

<li><p>
<b>Executing Modules as Scripts</b>
</p>

<p>
<code>python -m module</code>, <code>-m</code> 参数的由来
</p></li>

<li><p>
<b>Unified try/except/finally</b>
</p>

<p>
直到 <code>2.5</code> 版本, <code>try</code> 才可以同时使用: <code>except</code>, <code>finally</code>.
</p>

<p>
即, 你可以这样写了:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">try</span>:
    block-1 ...
<span style="font-weight: bold;">except</span> Exception1:
    handler-1 ...
<span style="font-weight: bold;">except</span> Exception2:
    handler-2 ...
<span style="font-weight: bold;">else</span>:
    <span style="font-weight: bold;">else</span>-block
<span style="font-weight: bold;">finally</span>:
    final-block
</pre>
</div>

<p>
<code>2.5</code> 以前不行, 貌似这是 <code>Python</code> 的作者从 <code>Java</code> 获取的灵感.
</p></li>

<li><p>
<b>New Generator Features</b>
</p>

<p>
<code>2.5</code> 版本对 <code>yield</code> 进行了一些修改, 使得它可以返回值了(之前不可以)
</p>

<p>
于是, 我们的生成器便成了这样:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">counter</span> (maximum):
    <span style="font-weight: bold; font-style: italic;">i</span> = 0
    <span style="font-weight: bold;">while</span> i &lt; maximum:
        <span style="font-weight: bold;">yield</span> i
        <span style="font-weight: bold; font-style: italic;">i</span> += 1
</pre>
</div>

<p>
对现在的我们来说, <code>yield</code> 似乎就是一个这样, 所以这里就不多讲了.
</p></li>

<li><p>
<b>The ‘with’ statement</b>
</p>

<p>
<code>2.5</code> 版本新增了 <code>with</code> 结构, 你可以这样使用它:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">with</span> expression [<span style="font-weight: bold;">as</span> variable]:
    <span style="font-weight: bold;">with</span>-block
</pre>
</div>

<p>
这里的 <code>expression</code> 返回的结果应该是一个上下文对象, 即这个对象至少包含:
<code>__enter__()</code>  和 <code>__exit__()</code> 方法.
</p>

<p>
<code>__enter__()</code> 在 <code>with-block</code> 代码块之前调用, <code>__exit__()</code> 在 <code>with-block</code>
代码块执行完成后调用.
</p>

<p>
当然, 如果你要使用这个功能在 <code>2.5</code> 版本, 你还需要这样的代码:
</p>
<pre class="example">
from __future__ import with_statement

</pre>

<ul class="org-ul">
<li><p>
<b>Writing Context Managers</b>
</p>

<p>
如果你要自己便写一个上下文对象, 需要注意以下细节:
</p>

<ul class="org-ul">
<li>表达式返回的对象应该是一个上下文对象, 这个对象至少包含有: <code>__enter__()</code>
和 <code>__exit__()</code> 方法.</li>

<li>上下文对象的 <code>__enter__()</code> 方法被调用, 返回值被分配给 <code>as variable</code> 指定的值.
如果没有指定值, 那么值将会被简单的丢弃.</li>

<li>代码块将被执行</li>

<li>如果代码块抛出一个异常, 那么 <code>__exit__(type, value, traceback)</code> 将被执行.</li>

<li>如果代码块没有抛出异常, 那么 <code>__exit__()</code> 仍然会执行, 只不过 <code>type</code>, <code>value</code>, <code>traceback</code> 都将是 <code>None</code></li>
</ul>

<p>
这里是一个例子:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20551;&#35774;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#21517;&#20026; DatabaseConnection &#30340;&#19978;&#19979;&#25991;&#23545;&#35937;</span>
<span style="font-weight: bold; font-style: italic;">db_connection</span> = DatabaseConnection()
<span style="font-weight: bold;">with</span> db_connection <span style="font-weight: bold;">as</span> cursor:
    cursor.execute(<span style="font-style: italic;">'insert into ...'</span>)
    cursor.execute(<span style="font-style: italic;">'delete from ...'</span>)
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">... more operations ...</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36825;&#20010;&#19978;&#19979;&#25991;&#23545;&#35937;&#30340;&#22522;&#26412;&#26041;&#27861;&#26377;</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">DatabaseConnection</span>:
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Database interface</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">cursor</span> (<span style="font-weight: bold;">self</span>):
        <span style="font-style: italic;">"Returns a cursor object and starts a new transaction"</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">commit</span> (<span style="font-weight: bold;">self</span>):
        <span style="font-style: italic;">"Commits current transaction"</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">rollback</span> (<span style="font-weight: bold;">self</span>):
        <span style="font-style: italic;">"Rolls back current transaction"</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#29616;&#22312;&#23450;&#20041;&#23427;&#30340; __enter__() &#26041;&#27861;</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">DatabaseConnection</span>:
    ...
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__enter__</span> (<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Code to start a new transaction</span>
        <span style="font-weight: bold; font-style: italic;">cursor</span> = <span style="font-weight: bold;">self</span>.cursor()
        <span style="font-weight: bold;">return</span> cursor

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#29616;&#22312;&#23450;&#20041;&#23427;&#30340; __exit__() &#26041;&#27861;</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">DatabaseConnection</span>:
    ...
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__exit__</span> (<span style="font-weight: bold;">self</span>, <span style="font-weight: bold;">type</span>, value, tb):
        <span style="font-weight: bold;">if</span> tb <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">No exception, so commit</span>
            <span style="font-weight: bold;">self</span>.commit()
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Exception occurred, so rollback.</span>
            <span style="font-weight: bold;">self</span>.rollback()
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">return False</span>
</pre>
</div></li>

<li><p>
<b>The contextlib module</b>
</p>

<p>
<code>2.5</code> 版本的一个新模块 <code>contextlib</code> 提供了一些 <b>函数</b> 和 一个 <b>装饰器</b>.
这些函数和装饰器对便写一个上下文对象很有帮助.
</p>

<p>
这个装饰器是: <code>contextmanager()</code>. 这个装饰器允许让你编写一个 <b>生成器</b> 来而不是编写一个 <b>类.</b>
</p>

<p>
你编写的 <b>生成器</b> 应该只返回 <b>一个值</b>.
</p>

<p>
这个生成器的 <b>yield</b> 将会被当做 <code>__enter__()</code> 方法执行. 而 <b>yield</b> 之后的代码将会当做 <code>__exit__()</code> 方法执行.
</p>

<p>
代码示例:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> contextlib <span style="font-weight: bold;">import</span> contextmanager

<span style="font-weight: bold; text-decoration: underline;">@contextmanager</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">db_transaction</span> (connection):
    <span style="font-weight: bold; font-style: italic;">cursor</span> = connection.cursor()
    <span style="font-weight: bold;">try</span>:
        <span style="font-weight: bold;">yield</span> cursor
    <span style="font-weight: bold;">except</span>:
        connection.rollback()
        <span style="font-weight: bold;">raise</span>
    <span style="font-weight: bold;">else</span>:
        connection.commit()

<span style="font-weight: bold; font-style: italic;">db</span> = DatabaseConnection()
<span style="font-weight: bold;">with</span> db_transaction(db) <span style="font-weight: bold;">as</span> cursor:
    ...
</pre>
</div>

<p>
另外, <code>contextlib</code> 模块包含了 <code>nested(mgr1, mgr2, ...)</code> 和 <code>closing(object)</code> 函数.
</p>

<p>
<code>nested</code> 允许你同时结合 <b>多个</b> 上下文管理器(而不是编写嵌套的 <b>with</b>).
</p>

<p>
而 <code>closing(object)</code> 返回 <code>object</code>, 所以可以被绑定到一个变量上. 并且在代码块执行完后会调用
<code>object.close</code> 方法.
</p>

<p>
使用例:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">nested</span>
<span style="font-weight: bold; font-style: italic;">lock</span> = threading.Lock()
<span style="font-weight: bold;">with</span> nested (db_transaction(db), lock) <span style="font-weight: bold;">as</span> (cursor, locked):
    ...

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">closing</span>
<span style="font-weight: bold;">with</span> closing(urllib.urlopen(<span style="font-style: italic;">'http://www.yahoo.com'</span>)) <span style="font-weight: bold;">as</span> f:
    <span style="font-weight: bold;">for</span> line <span style="font-weight: bold;">in</span> f:
        sys.stdout.write(line)
</pre>
</div></li>
</ul></li>

<li><p>
<b>Exceptions as New-Style Classes</b>
</p>

<p>
<code>2.5</code> 版本的异常的继承层次被重新安排了一下， 现在是这样的:
</p>

<pre class="example">
BaseException       # New in Python 2.5
|- KeyboardInterrupt
|- SystemExit
|- Exception
   |- (all other current built-in exceptions)
</pre>

<p>
所以现在可以使用: <code>except:</code> 来捕获 <b>所有的</b> 异常了(以前的版本啥样的&#x2026;)
</p></li>

<li><p>
<b>Using ssize_t as the index type</b>
</p>

<p>
这个是针对 <code>Python's C API</code> 的, 使用一个新的类型 <code>Py_ssize_t</code> 来替代 <code>int</code>.
好方便 <code>Python</code> 在 <code>64</code> 位机上处理更多的数据, 而不影响 <code>32</code> 位机.
</p>

<p>
嗯&#x2026; 没感觉
</p></li>

<li><p>
<b>The ‘__index__’ method</b>
</p>

<p>
<code>2.5</code> 版本添加了 <code>__index__()</code> 方法, 这个方法不接受参数并且返回一个整型的数字,
用于分片索引的使用.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">C</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__index__</span> (<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.value
</pre>
</div>

<p>
值得注意的是, 这个返回值的类型必须是一个 python 整型/长整型, 否则会出现 <code>TypeError</code> 错误.
</p></li>
</ol>
</div>
</div>
