2018/python2.5-2.7.org
** 核心语言变化
   以下是Python 2.5对Python核心语言所做的更改.

   + 字典类型 =dict= 多了一个新的方法 =__missing__(key)=. 当访问的键不存在在时, 让子类的
     =__missing__(key)= 方法提供值.

     代码示例:

     #+BEGIN_SRC python
       class zerodict (dict):
           def __missing__ (self, key):
               return 0

       d = zerodict({1:1, 2:2})
       print d[1], d[2]   # Prints 1, 2
       print d[3], d[4]   # Prints 0, 0
     #+END_SRC

   + 所有的 8-bit 字符和 Unicode 字符都有了新的 =partition(sep)= 和 =rpartition(sep)= 方法来
     简化常见用例.

     这两个方法返回一个三元组, 根据 =sep= 指定的分隔符分割, 如果 =sep= 为找的, 那么
     元组的另外两个值为 =''=

     代码说明一切:

     #+BEGIN_SRC python
       >>> ('http://www.python.org').partition('://')
       ('http', '://', 'www.python.org')
       >>> ('file:/usr/share/doc/index.html').partition('://')
       ('file:/usr/share/doc/index.html', '', '')
       >>> (u'Subject: a quick question').partition(':')
       (u'Subject', u':', u' a quick question')
       >>> 'www.python.org'.rpartition('.')
       ('www.python', '.', 'org')
       >>> 'www.python.org'.rpartition(':')
       ('', '', 'www.python.org')
     #+END_SRC

     =r= 代表反向.

   + 字符串类型的 =startswith()= 和 =endswith()= 方法支持元组作为参数.

     #+BEGIN_SRC python
       def is_image_file (filename):
           return filename.endswith(('.gif', '.jpg', '.tiff'))
     #+END_SRC

   + 内建函数 =min()= 和 =max()= 增加了关键字参数 =key=, 用于对值排序.
     
     #+BEGIN_SRC python
       L = ['medium', 'longest', 'short']
       # Prints 'longest'
       print max(L, key=len)
       # Prints 'short', because lexicographically 'short' has the largest value
       print max(L)
     #+END_SRC

   + 新的内建函数 =any()= 和 =all()=.
     =any()=: 如果迭代器有元素为 =True= 便返回 =True=
     =all()=: 迭代器所有元素为 =True= 才返回 =True=

   + 类的 =__hash__()= 方法现在可以返回一个长整数会常规整数

   + ASCII现在是模块的默认编码.
     
     所有我们要在文件顶部加:
     : # -*- coding: utf-8 -*-

   + 一个新的警告 =UnicodeWarning=, 怎么样? 是不是有点熟悉...
     
     警告发生在你尝试比较一个 *ASCII* 字符串和一个 *Unicode* 字符串, 而 Unicode 字符串
     _不能转化为 ASCII 字符串_ 的时候

   + 从 =2.5= 版本开始, 如果你的包里没有 =__init__.py=, 将会出现 =ImportWarning=

   + 你现在可以定义一个这样的类了:

     #+BEGIN_SRC python
       class C():
           pass
     #+END_SRC

   [[https://docs.python.org/2/whatsnew/2.5.html#interactive-interpreter-changes][more...]]

** 其他内容
   其他的内容包括: [[https://docs.python.org/2/whatsnew/2.5.html#new-improved-and-removed-modules][新增, 改进, 移除的模块]], [[https://docs.python.org/2/whatsnew/2.5.html#build-and-c-api-changes][Python 构建过程和 C API 的变化]] ...

   感觉这些内容还是看现在的文档吧 !

* Python2.6
  ok, 搞定了 =2.5=, 可以进入 =2.6= 了 ！

  通过文档发现, =2.6= 版本的主题是向 =3.0= 迁移. 所以这个版本就已经在尽可能的
  适应可能的 =3.0= 版本可能拥有的特性了.

  =3.0= 版本和 =2.6= 版本居然是同步开发, 难怪现在就是 =3.6= 了...

  好了, 直接开始正题了 ！

