2018/python2.5-2.7.html

<div id="outline-container-org2e74a6f" class="outline-3">
<h3 id="org2e74a6f"><span class="section-number-3">2.2</span> 核心语言变化</h3>
<div class="outline-text-3" id="text-2-2">
<p>
以下是Python 2.5对Python核心语言所做的更改.
</p>

<ul class="org-ul">
<li><p>
字典类型 <code>dict</code> 多了一个新的方法 <code>__missing__(key)</code>. 当访问的键不存在在时, 让子类的
<code>__missing__(key)</code> 方法提供值.
</p>

<p>
代码示例:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">zerodict</span> (<span style="font-weight: bold;">dict</span>):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__missing__</span> (<span style="font-weight: bold;">self</span>, key):
        <span style="font-weight: bold;">return</span> 0

<span style="font-weight: bold; font-style: italic;">d</span> = zerodict({1:1, 2:2})
<span style="font-weight: bold;">print</span> d[1], d[2]   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Prints 1, 2</span>
<span style="font-weight: bold;">print</span> d[3], d[4]   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Prints 0, 0</span>
</pre>
</div></li>

<li><p>
所有的 8-bit 字符和 Unicode 字符都有了新的 <code>partition(sep)</code> 和 <code>rpartition(sep)</code> 方法来
简化常见用例.
</p>

<p>
这两个方法返回一个三元组, 根据 <code>sep</code> 指定的分隔符分割, 如果 <code>sep</code> 为找的, 那么
元组的另外两个值为 <code>''</code>
</p>

<p>
代码说明一切:
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; (<span style="font-style: italic;">'http://www.python.org'</span>).partition(<span style="font-style: italic;">'://'</span>)
(<span style="font-style: italic;">'http'</span>, <span style="font-style: italic;">'://'</span>, <span style="font-style: italic;">'www.python.org'</span>)
&gt;&gt;&gt; (<span style="font-style: italic;">'file:/usr/share/doc/index.html'</span>).partition(<span style="font-style: italic;">'://'</span>)
(<span style="font-style: italic;">'file:/usr/share/doc/index.html'</span>, <span style="font-style: italic;">''</span>, <span style="font-style: italic;">''</span>)
&gt;&gt;&gt; (u<span style="font-style: italic;">'Subject: a quick question'</span>).partition(<span style="font-style: italic;">':'</span>)
(u<span style="font-style: italic;">'Subject'</span>, u<span style="font-style: italic;">':'</span>, u<span style="font-style: italic;">' a quick question'</span>)
&gt;&gt;&gt; <span style="font-style: italic;">'www.python.org'</span>.rpartition(<span style="font-style: italic;">'.'</span>)
(<span style="font-style: italic;">'www.python'</span>, <span style="font-style: italic;">'.'</span>, <span style="font-style: italic;">'org'</span>)
&gt;&gt;&gt; <span style="font-style: italic;">'www.python.org'</span>.rpartition(<span style="font-style: italic;">':'</span>)
(<span style="font-style: italic;">''</span>, <span style="font-style: italic;">''</span>, <span style="font-style: italic;">'www.python.org'</span>)
</pre>
</div>

<p>
<code>r</code> 代表反向.
</p></li>

<li><p>
字符串类型的 <code>startswith()</code> 和 <code>endswith()</code> 方法支持元组作为参数.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">is_image_file</span> (filename):
    <span style="font-weight: bold;">return</span> filename.endswith((<span style="font-style: italic;">'.gif'</span>, <span style="font-style: italic;">'.jpg'</span>, <span style="font-style: italic;">'.tiff'</span>))
</pre>
</div></li>

<li><p>
内建函数 <code>min()</code> 和 <code>max()</code> 增加了关键字参数 <code>key</code>, 用于对值排序.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">L</span> = [<span style="font-style: italic;">'medium'</span>, <span style="font-style: italic;">'longest'</span>, <span style="font-style: italic;">'short'</span>]
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Prints 'longest'</span>
<span style="font-weight: bold;">print</span> <span style="font-weight: bold;">max</span>(L, key=<span style="font-weight: bold;">len</span>)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Prints 'short', because lexicographically 'short' has the largest value</span>
<span style="font-weight: bold;">print</span> <span style="font-weight: bold;">max</span>(L)
</pre>
</div></li>

<li>新的内建函数 <code>any()</code> 和 <code>all()</code>.
<code>any()</code>: 如果迭代器有元素为 <code>True</code> 便返回 <code>True</code>
<code>all()</code>: 迭代器所有元素为 <code>True</code> 才返回 <code>True</code></li>

<li>类的 <code>__hash__()</code> 方法现在可以返回一个长整数会常规整数</li>

<li><p>
ASCII现在是模块的默认编码.
</p>

<p>
所有我们要在文件顶部加:
</p>
<pre class="example">
# -*- coding: utf-8 -*-

</pre></li>

<li><p>
一个新的警告 <code>UnicodeWarning</code>, 怎么样? 是不是有点熟悉&#x2026;
</p>

<p>
警告发生在你尝试比较一个 <b>ASCII</b> 字符串和一个 <b>Unicode</b> 字符串, 而 Unicode 字符串
<span class="underline">不能转化为 ASCII 字符串</span> 的时候
</p></li>

<li>从 <code>2.5</code> 版本开始, 如果你的包里没有 <code>__init__.py</code>, 将会出现 <code>ImportWarning</code></li>

<li><p>
你现在可以定义一个这样的类了:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">C</span>():
    <span style="font-weight: bold;">pass</span>
</pre>
</div></li>
</ul>

<p>
<a href="https://docs.python.org/2/whatsnew/2.5.html#interactive-interpreter-changes">more&#x2026;</a>
</p>
</div>
</div>

<div id="outline-container-org0ab5b5f" class="outline-3">
<h3 id="org0ab5b5f"><span class="section-number-3">2.3</span> 其他内容</h3>
<div class="outline-text-3" id="text-2-3">
<p>
其他的内容包括: <a href="https://docs.python.org/2/whatsnew/2.5.html#new-improved-and-removed-modules">新增, 改进, 移除的模块</a>, <a href="https://docs.python.org/2/whatsnew/2.5.html#build-and-c-api-changes">Python 构建过程和 C API 的变化</a> &#x2026;
</p>

<p>
感觉这些内容还是看现在的文档吧 !
</p>
</div>
</div>
</div>

<div id="outline-container-org13498cd" class="outline-2">
<h2 id="org13498cd"><span class="section-number-2">3</span> Python2.6</h2>
<div class="outline-text-2" id="text-3">
<p>
ok, 搞定了 <code>2.5</code>, 可以进入 <code>2.6</code> 了 ！
</p>

<p>
通过文档发现, <code>2.6</code> 版本的主题是向 <code>3.0</code> 迁移. 所以这个版本就已经在尽可能的
适应可能的 <code>3.0</code> 版本可能拥有的特性了.
</p>

<p>
<code>3.0</code> 版本和 <code>2.6</code> 版本居然是同步开发, 难怪现在就是 <code>3.6</code> 了&#x2026;
</p>

<p>
好了, 直接开始正题了 ！
</p>
</div>
