2018/python2.5-2.7.org
** 主要语言变化
   对比 =2.5=, =2.6= 版本的 Python 多了这些变化.

   1. *The ‘with’ statement*

      嗯, 也就是说在 =2.6= 版本使用 =with= 就不需要这样了:
      : from __future__ import with_statement

      可喜可贺, 但是其他内容貌似没有太多变化 !

   2. *Explicit Relative Imports From a Main Module*
      
      =2.5= 版本的 =-m= 参数虽然允许了像运行一个脚本那样运行一个模块,
      但是如果运行一个 *包* 内的模块的时候, *相对导入* 会出现错误.

      为了修复这个 *bug*, =2.6= 版本为模块添加了 =__package__= 属性.
      当这个属性存在的时候, 相对导入将依据这个属性的值而不是 =__name__= 的值.

   3. *The multiprocessing Package*

      这个新的多进程的包允许 Python 程序创建新的进程, 执行计算并将结果返回给父进程.

      父进程和子进程通过 *管道* 和 *队列* 进行通信.

      这里有几个类, 分别是: =Process=, =Queue=, =Pool=, =Manager=.

      + =Process= 的 =start()= 方法启动一个子进程, =is_alive()= 方法判断进程是否存活, 
        =join()= 方法等待子进程退出.

      + =Queue= 对象储存在 *全局变量* 之中, 所以父进程和子进程可以通过队列来传递信息.

      #+BEGIN_SRC python
        import time
        from multiprocessing import Process, Queue


        def factorial(queue, N):
            "Compute a factorial."
            # If N is a multiple of 4, this function will take much longer.
            if (N % 4) == 0:
                time.sleep(.05 * N/4)

            # Calculate the result
            fact = 1L
            for i in range(1, N+1):
                fact = fact * i

            # Put the result on the queue
            queue.put(fact)

        if __name__ == '__main__':
            queue = Queue()

            N = 5

            p = Process(target=factorial, args=(queue, N))
            p.start()
            p.join()

            result = queue.get()
            print 'Factorial', N, '=', result
      #+END_SRC

      + =Pool= 提供更高级的接口. =Pool= 可以创建固定数量的 =工作进程=, 可以通过 =apply()= 或 =apply_async()= 方法来
        请求使用. 也可以使用 =map()= 或 =map_async()= 来添加一些请求.

      #+BEGIN_SRC python
        from multiprocessing import Pool

        def factorial(N, dictionary):
            "Compute a factorial."
            ...
        p = Pool(5)
        result = p.map(factorial, range(1, 1000, 10))
        for v in result:
            print v


        # 输出的结果:
        1
        39916800
        51090942171709440000
        8222838654177922817725562880000000
        33452526613163807108170062053440751665152000000000
        ...
      #+END_SRC

      + =Manager= 同样提供高级的接口. =Manager= 会创建一个单独的服务器进程，可以保存Python数据结构的主副本.
        其他进程可以使用代理对象访问和修改这些数据结构. 

        #+BEGIN_SRC python
          import time
          from multiprocessing import Pool, Manager

          def factorial(N, dictionary):
              "Compute a factorial."
              # Calculate the result
              fact = 1L
              for i in range(1, N+1):
                  fact = fact * i

              # Store result in dictionary
              dictionary[N] = fact

          if __name__ == '__main__':
              p = Pool(5)
              mgr = Manager()
              d = mgr.dict()         # Create shared dictionary

              # Run tasks using the pool
              for N in range(1, 1000, 10):
                  p.apply_async(factorial, (N, d))

              # Mark pool as closed -- no more tasks can be added.
              p.close()

              # Wait for tasks to exit
              p.join()

              # Output results
              for k, v in sorted(d.items()):
                  print k, v

          # 输出的结果:
          1 1
          11 39916800
          21 51090942171709440000
          31 8222838654177922817725562880000000
          41 33452526613163807108170062053440751665152000000000
          51 15511187532873822802242430164693032110632597200169861120000...
        #+END_SRC

      详细的使用还是查阅文档吧...

      [[https://docs.python.org/2/library/multiprocessing.html#module-multiprocessing][multiprocessing]]

   4. *Advanced String Formatting*

      嗯, 字符串对象新增了 =format()= 方法, 因为 =3.0= 版本的 =%= 有了更强大的方法 =format()= 方法
      作为补充.

      据说未来的版本中 操作符 =%= 可能要废除, 所以可以考虑一下在代码编写的过程中更多的使用 =format()=.

   5. *print As a Function*

      =print= 从关键字变成函数了.(=3.x= 版本默认如此)

      如果要在 =2.6, 2.7= 使用的话, 还需要这样:
      : from __future__ import print_function

      =print= 函数是这样的:
      : def print(*args, sep=' ', end='\n', file=None)

      参数说明:

      + args: 将值打印出来的位置参数

      + sep: 分隔符, 将在参数之间打印

      + end: 结束文本, 在所有参数打印完成后输出, 默认是换行.

      + file: 输出将被发送到的文件对象.

   6. *Exception-Handling Changes*

      因为Python程序员有时会犯这样的错误:
      
      #+BEGIN_SRC python
        try:
            ...
        except TypeError, ValueError:  # Wrong!
            ...

        # 正确写法:
        try:
            ...
        except (TypeError, ValueError):
            ...
      #+END_SRC

      为了减少这样的错误, =3.0= 版本开始异常的捕获必须这样写了:

      #+BEGIN_SRC python
        try:
            ...
        except TypeError as exc:
            ...
      #+END_SRC

      当然, 在 =2.6= 版本, 中间是逗号或as的版本都可以用, 但很明显, 你更应该选择 =as=

   7. *Byte Literals*

      =3.0= 版本开始, 文本字符串的类型便默认为 =Unicode= 了.并使用不同的方法来表示
      8位字符. 如 =b'string'= 或 =bytes= 构造函数.

      为了向前兼容, =2.6= 版本添加了 =bytes= 作为 =str= 的同义字. 并同样支持 =b''= 符号.

      但是 =2.6= 版本的 =str= 和 =3.0= 版本的 =bytes= 还是有很多不同. 最特别的是:

      #+BEGIN_SRC python
        # 2.6 版本例:

        >>> bytes([65, 66, 67])
        '[65, 66, 67]'

        # 3.0 版本例

        >>> bytes([65, 66, 67])
        b'ABC'
      #+END_SRC
      
      差别很明显了. =2.6= 版本中的 =bytes= 还是主要用于编写像 =isinstance(x, bytes)= 的类型
      检测器. 方便 =2.x= 版本向 =3.x= 版本转化.

      另外, 你还可以从 =__future__= 导入 =unicode_literals=, 这将使得所有字符串变为 =Unicode= 字符串.
      这意味着 =\u= 转义序列可以用来包含 =Unicode= 字符:

      #+BEGIN_SRC python
        from __future__ import unicode_literals

        s = ('\u751f\u3080\u304e\u3000\u751f\u3054'
             '\u3081\u3000\u751f\u305f\u307e\u3054')

        print len(s)               # 12 Unicode characters
      #+END_SRC

   8. *New I/O Library*

      这方面的内容在使用过程中实在没有太多感触, 有兴趣的可以了解一下.

      传送门: [[https://docs.python.org/2/whatsnew/2.6.html#pep-3116-new-i-o-library][PEP 3116: New I/O Library]]

   9. *Revised Buffer Protocol*

      偏向于 =C API= 的内容. 这个还是参照现在的文档吧.

   10. *Abstract Base Classes*

       如果你学过 Java, C++, C# 等中的任何一门, 那么这个更新应该不难理解.

       =ABCs(Abstract Base Classes)= 类似于其他语言中的 =接口或抽象类= 的概念. 你可以定义一个
       基本的类, 而继承这个类的子类可能必须实现这个基类定义的某些方法. 另一方面, 你可以继承一些现成
       的 =ABC(Abstract Base Classe)= 来实现一些功能而非手动定义.

       =2.6= 版本存在一个模块 =collections=, 这个模块定义了一些基类, 比如说 =Iterable= 表示一个类定义了 =__iter__()=,
       =Container= 说明一个类定义了 =__contains__()=, 即支持: =x in y= 表达式. 而 =MutableMapping= 表名这个类支持字典类型的基础功能, 如:
       =keys(), values(), items()=.

       这些类有两种使用方式:

       #+BEGIN_SRC python
         import collections

         class Storage(collections.MutableMapping):
             ...

         # 或

         import collections

         class Storage:
             ...

         collections.MutableMapping.register(Storage)

         # 第一种方式要简洁一些, 但第二种在某些时候可能很有用
         # 比如你定义了自己的 ABC 的时候， 如 PrintableType

         # Register Python's types
         PrintableType.register(int)
         PrintableType.register(float)
         PrintableType.register(str)
       #+END_SRC

       如果要检查一个类是否支持某个接口, 可以这样做:

       #+BEGIN_SRC python
         def func(d):
             if not isinstance(d, collections.MutableMapping):
                 raise ValueError("Mapping object expected, not %r" % d)
       #+END_SRC

       当然, 你不必时时刻刻进行类型检查, 只需要在必须的时候做好这一点即可.

       你可以使用 =abc.ABCMeta= 作为类定义中的元类来编写自己的ABCs:

       #+BEGIN_SRC python
         from abc import ABCMeta, abstractmethod

         class Drawable():
             __metaclass__ = ABCMeta

             @abstractmethod
             def draw(self, x, y, scale=1.0):
                 pass

             def draw_doubled(self, x, y):
                 self.draw(x, y, scale=2.0)


         class Square(Drawable):
             def draw(self, x, y, scale):
                 ...
       #+END_SRC

       由装饰器 =@abstractmethod= 修饰的方法在子类继承的时候必须实现, 如 =draw=.
       而 =draw_double= 并不需要.

       抽象的属性通过 =@abstractproperty= 实现.

       #+BEGIN_SRC python
         from abc import abstractproperty
         ...

         @abstractproperty
         def readonly(self):
            return self._x
       #+END_SRC

       ps: 亏得我一直以为python没有这个功能....

   11. *Integer Literal Support and Syntax*

       来自 =3.0= 版本的变化, =2.6= 版本支持 =0o= 和 =0b= 作为前导字符的 八进制和二进制数字.

       #+BEGIN_SRC python
         >>> 0o21, 2*8 + 1
         (17, 17)
         >>> 0b101111
         47

         # 内建函数 0ct() 仍然返回前导 0 的字符.
         # 新增内建函数 bin() 返回二进制串.

         >>> oct(42)
         '052'
         >>> future_builtins.oct(42)
         '0o52'
         >>> bin(173)
         '0b10101101'

         # 函数 int() 和 long() 开始支持 '0o' 个 '0b' 开头的字符串.
         # 或者即便参数为 0 的时候(表示所使用的基数从字符串确定)

         >>> int ('0o52', 0)
         42
         >>> int('1101', 2)
         13
         >>> int('0b1101', 2)
         13
         >>> int('0b1101', 0)
         13
       #+END_SRC

   12. *Class Decorators*

       类装饰器 ?

       #+BEGIN_SRC python
         @foo
         @bar
         class A:
           pass

         # 等价于:

         class A:
           pass

         A = foo(bar(A))
       #+END_SRC

   13. *A Type Hierarchy for Numbers*

       数字类型的继承关系:

       #+BEGIN_EXAMPLE
         Number  -- 基类
         `-- Complex  -- 继承自 Number, 代表复数类
             `-- Real -- 继承自 Complex, 代表实数类
                 `-- Rational -- 继承自 Real, 代表有理数类(可以被转化为 floats)
                     `-- Integral -- 继承自 Rational, 代表整数类, 支持 <<, >>, |, & 运算
       #+END_EXAMPLE

       额, 厉害 ！

       * *The fractions Module*

         =2.6= 版本新增了 =fractions= 模块来更好的表示有理数. 这需要用到这个模块的
         =Fraction= 类.

         #+BEGIN_SRC python
           >>> from fractions import Fraction
           >>> a = Fraction(2, 3)
           >>> b = Fraction(2, 5)
           >>> float(a), float(b)
           (0.66666666666666663, 0.40000000000000002)
           >>> a+b
           Fraction(16, 15)
           >>> a/b
           Fraction(5, 3)
         #+END_SRC

         另外可以通过 =as_integer_ratio()= 方法将浮点数转化为有理数.

         #+BEGIN_SRC python
           >>> (2.5) .as_integer_ratio()
           (5, 2)
           >>> (3.1415) .as_integer_ratio()
           (7074029114692207L, 2251799813685248L)
           >>> (1./3) .as_integer_ratio()
           (6004799503160661L, 18014398509481984L)
         #+END_SRC

         注意第三个例子, 这个函数的转化是通过近似的值来完成的(不是近似的样子)
       
