2018/python2.5-2.7.html

<div id="outline-container-org7527652" class="outline-3">
<h3 id="org7527652"><span class="section-number-3">3.1</span> 主要语言变化</h3>
<div class="outline-text-3" id="text-3-1">
<p>
对比 <code>2.5</code>, <code>2.6</code> 版本的 Python 多了这些变化.
</p>

<ol class="org-ol">
<li><p>
<b>The ‘with’ statement</b>
</p>

<p>
嗯, 也就是说在 <code>2.6</code> 版本使用 <code>with</code> 就不需要这样了:
</p>
<pre class="example">
from __future__ import with_statement

</pre>

<p>
可喜可贺, 但是其他内容貌似没有太多变化 !
</p></li>

<li><p>
<b>Explicit Relative Imports From a Main Module</b>
</p>

<p>
<code>2.5</code> 版本的 <code>-m</code> 参数虽然允许了像运行一个脚本那样运行一个模块,
但是如果运行一个 <b>包</b> 内的模块的时候, <b>相对导入</b> 会出现错误.
</p>

<p>
为了修复这个 <b>bug</b>, <code>2.6</code> 版本为模块添加了 <code>__package__</code> 属性.
当这个属性存在的时候, 相对导入将依据这个属性的值而不是 <code>__name__</code> 的值.
</p></li>

<li><p>
<b>The multiprocessing Package</b>
</p>

<p>
这个新的多进程的包允许 Python 程序创建新的进程, 执行计算并将结果返回给父进程.
</p>

<p>
父进程和子进程通过 <b>管道</b> 和 <b>队列</b> 进行通信.
</p>

<p>
这里有几个类, 分别是: <code>Process</code>, <code>Queue</code>, <code>Pool</code>, <code>Manager</code>.
</p>

<ul class="org-ul">
<li><code>Process</code> 的 <code>start()</code> 方法启动一个子进程, <code>is_alive()</code> 方法判断进程是否存活,
<code>join()</code> 方法等待子进程退出.</li>

<li><code>Queue</code> 对象储存在 <b>全局变量</b> 之中, 所以父进程和子进程可以通过队列来传递信息.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> time
<span style="font-weight: bold;">from</span> multiprocessing <span style="font-weight: bold;">import</span> Process, Queue


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">factorial</span>(queue, N):
    <span style="font-style: italic;">"Compute a factorial."</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">If N is a multiple of 4, this function will take much longer.</span>
    <span style="font-weight: bold;">if</span> (N % 4) == 0:
        time.sleep(.05 * N/4)

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Calculate the result</span>
    <span style="font-weight: bold; font-style: italic;">fact</span> = 1L
    <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, N+1):
        <span style="font-weight: bold; font-style: italic;">fact</span> = fact * i

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Put the result on the queue</span>
    queue.put(fact)

<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">__name__</span> == <span style="font-style: italic;">'__main__'</span>:
    <span style="font-weight: bold; font-style: italic;">queue</span> = Queue()

    <span style="font-weight: bold; font-style: italic;">N</span> = 5

    <span style="font-weight: bold; font-style: italic;">p</span> = Process(target=factorial, args=(queue, N))
    p.start()
    p.join()

    <span style="font-weight: bold; font-style: italic;">result</span> = queue.get()
    <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'Factorial'</span>, N, <span style="font-style: italic;">'='</span>, result
</pre>
</div>

<ul class="org-ul">
<li><code>Pool</code> 提供更高级的接口. <code>Pool</code> 可以创建固定数量的 <code>工作进程</code>, 可以通过 <code>apply()</code> 或 <code>apply_async()</code> 方法来
请求使用. 也可以使用 <code>map()</code> 或 <code>map_async()</code> 来添加一些请求.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> multiprocessing <span style="font-weight: bold;">import</span> Pool

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">factorial</span>(N, dictionary):
    <span style="font-style: italic;">"Compute a factorial."</span>
    ...
    <span style="font-weight: bold; font-style: italic;">p</span> = Pool(5)
    <span style="font-weight: bold; font-style: italic;">result</span> = p.<span style="font-weight: bold;">map</span>(factorial, <span style="font-weight: bold;">range</span>(1, 1000, 10))
<span style="font-weight: bold;">for</span> v <span style="font-weight: bold;">in</span> result:
    <span style="font-weight: bold;">print</span> v


<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36755;&#20986;&#30340;&#32467;&#26524;:</span>
1
39916800
51090942171709440000
8222838654177922817725562880000000
33452526613163807108170062053440751665152000000000
...
</pre>
</div>

<ul class="org-ul">
<li><p>
<code>Manager</code> 同样提供高级的接口. <code>Manager</code> 会创建一个单独的服务器进程，可以保存Python数据结构的主副本.
其他进程可以使用代理对象访问和修改这些数据结构.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> time
<span style="font-weight: bold;">from</span> multiprocessing <span style="font-weight: bold;">import</span> Pool, Manager

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">factorial</span>(N, dictionary):
    <span style="font-style: italic;">"Compute a factorial."</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Calculate the result</span>
    <span style="font-weight: bold; font-style: italic;">fact</span> = 1L
    <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, N+1):
        <span style="font-weight: bold; font-style: italic;">fact</span> = fact * i

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Store result in dictionary</span>
    <span style="font-weight: bold; font-style: italic;">dictionary</span>[N] = fact

<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">__name__</span> == <span style="font-style: italic;">'__main__'</span>:
    <span style="font-weight: bold; font-style: italic;">p</span> = Pool(5)
    <span style="font-weight: bold; font-style: italic;">mgr</span> = Manager()
    <span style="font-weight: bold; font-style: italic;">d</span> = mgr.<span style="font-weight: bold;">dict</span>()         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create shared dictionary</span>

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Run tasks using the pool</span>
    <span style="font-weight: bold;">for</span> N <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, 1000, 10):
        p.apply_async(factorial, (N, d))

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Mark pool as closed -- no more tasks can be added.</span>
    p.close()

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Wait for tasks to exit</span>
    p.join()

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Output results</span>
    <span style="font-weight: bold;">for</span> k, v <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">sorted</span>(d.items()):
        <span style="font-weight: bold;">print</span> k, v

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36755;&#20986;&#30340;&#32467;&#26524;:</span>
1 1
11 39916800
21 51090942171709440000
31 8222838654177922817725562880000000
41 33452526613163807108170062053440751665152000000000
51 15511187532873822802242430164693032110632597200169861120000...
</pre>
</div></li>
</ul>

<p>
详细的使用还是查阅文档吧&#x2026;
</p>

<p>
<a href="https://docs.python.org/2/library/multiprocessing.html#module-multiprocessing">multiprocessing</a>
</p></li>

<li><p>
<b>Advanced String Formatting</b>
</p>

<p>
嗯, 字符串对象新增了 <code>format()</code> 方法, 因为 <code>3.0</code> 版本的 <code>%</code> 有了更强大的方法 <code>format()</code> 方法
作为补充.
</p>

<p>
据说未来的版本中 操作符 <code>%</code> 可能要废除, 所以可以考虑一下在代码编写的过程中更多的使用 <code>format()</code>.
</p></li>

<li><p>
<b>print As a Function</b>
</p>

<p>
<code>print</code> 从关键字变成函数了.(<code>3.x</code> 版本默认如此)
</p>

<p>
如果要在 <code>2.6, 2.7</code> 使用的话, 还需要这样:
</p>
<pre class="example">
from __future__ import print_function

</pre>

<p>
<code>print</code> 函数是这样的:
</p>
<pre class="example">
def print(*args, sep=' ', end='\n', file=None)

</pre>

<p>
参数说明:
</p>

<ul class="org-ul">
<li>args: 将值打印出来的位置参数</li>

<li>sep: 分隔符, 将在参数之间打印</li>

<li>end: 结束文本, 在所有参数打印完成后输出, 默认是换行.</li>

<li>file: 输出将被发送到的文件对象.</li>
</ul></li>

<li><p>
<b>Exception-Handling Changes</b>
</p>

<p>
因为Python程序员有时会犯这样的错误:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">try</span>:
    ...
<span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>, <span style="font-weight: bold; text-decoration: underline;">ValueError</span>:  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Wrong!</span>
    ...

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#27491;&#30830;&#20889;&#27861;:</span>
<span style="font-weight: bold;">try</span>:
    ...
<span style="font-weight: bold;">except</span> (<span style="font-weight: bold; text-decoration: underline;">TypeError</span>, <span style="font-weight: bold; text-decoration: underline;">ValueError</span>):
    ...
</pre>
</div>

<p>
为了减少这样的错误, <code>3.0</code> 版本开始异常的捕获必须这样写了:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">try</span>:
    ...
<span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span> <span style="font-weight: bold;">as</span> exc:
    ...
</pre>
</div>

<p>
当然, 在 <code>2.6</code> 版本, 中间是逗号或as的版本都可以用, 但很明显, 你更应该选择 <code>as</code>
</p></li>

<li><p>
<b>Byte Literals</b>
</p>

<p>
<code>3.0</code> 版本开始, 文本字符串的类型便默认为 <code>Unicode</code> 了.并使用不同的方法来表示
8位字符. 如 <code>b'string'</code> 或 <code>bytes</code> 构造函数.
</p>

<p>
为了向前兼容, <code>2.6</code> 版本添加了 <code>bytes</code> 作为 <code>str</code> 的同义字. 并同样支持 <code>b</code> 符号.
</p>

<p>
但是 <code>2.6</code> 版本的 <code>str</code> 和 <code>3.0</code> 版本的 <code>bytes</code> 还是有很多不同. 最特别的是:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">2.6 &#29256;&#26412;&#20363;:</span>

&gt;&gt;&gt; <span style="font-weight: bold;">bytes</span>([65, 66, 67])
<span style="font-style: italic;">'[65, 66, 67]'</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">3.0 &#29256;&#26412;&#20363;</span>

&gt;&gt;&gt; <span style="font-weight: bold;">bytes</span>([65, 66, 67])
b<span style="font-style: italic;">'ABC'</span>
</pre>
</div>

<p>
差别很明显了. <code>2.6</code> 版本中的 <code>bytes</code> 还是主要用于编写像 <code>isinstance(x, bytes)</code> 的类型
检测器. 方便 <code>2.x</code> 版本向 <code>3.x</code> 版本转化.
</p>

<p>
另外, 你还可以从 <code>__future__</code> 导入 <code>unicode_literals</code>, 这将使得所有字符串变为 <code>Unicode</code> 字符串.
这意味着 <code>\u</code> 转义序列可以用来包含 <code>Unicode</code> 字符:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> __future__ <span style="font-weight: bold;">import</span> unicode_literals

<span style="font-weight: bold; font-style: italic;">s</span> = (<span style="font-style: italic;">'\u751f\u3080\u304e\u3000\u751f\u3054'</span>
     <span style="font-style: italic;">'\u3081\u3000\u751f\u305f\u307e\u3054'</span>)

<span style="font-weight: bold;">print</span> <span style="font-weight: bold;">len</span>(s)               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">12 Unicode characters</span>
</pre>
</div></li>

<li><p>
<b>New I/O Library</b>
</p>

<p>
这方面的内容在使用过程中实在没有太多感触, 有兴趣的可以了解一下.
</p>

<p>
传送门: <a href="https://docs.python.org/2/whatsnew/2.6.html#pep-3116-new-i-o-library">PEP 3116: New I/O Library</a>
</p></li>

<li><p>
<b>Revised Buffer Protocol</b>
</p>

<p>
偏向于 <code>C API</code> 的内容. 这个还是参照现在的文档吧.
</p></li>

<li><p>
<b>Abstract Base Classes</b>
</p>

<p>
如果你学过 Java, C++, C# 等中的任何一门, 那么这个更新应该不难理解.
</p>

<p>
<code>ABCs(Abstract Base Classes)</code> 类似于其他语言中的 <code>接口或抽象类</code> 的概念. 你可以定义一个
基本的类, 而继承这个类的子类可能必须实现这个基类定义的某些方法. 另一方面, 你可以继承一些现成
的 <code>ABC(Abstract Base Classe)</code> 来实现一些功能而非手动定义.
</p>

<p>
<code>2.6</code> 版本存在一个模块 <code>collections</code>, 这个模块定义了一些基类, 比如说 <code>Iterable</code> 表示一个类定义了 <code>__iter__()</code>,
<code>Container</code> 说明一个类定义了 <code>__contains__()</code>, 即支持: <code>x in y</code> 表达式. 而 <code>MutableMapping</code> 表名这个类支持字典类型的基础功能, 如:
<code>keys(), values(), items()</code>.
</p>

<p>
这些类有两种使用方式:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> collections

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Storage</span>(collections.MutableMapping):
    ...

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#25110;</span>

<span style="font-weight: bold;">import</span> collections

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Storage</span>:
    ...

collections.MutableMapping.register(Storage)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#31532;&#19968;&#31181;&#26041;&#24335;&#35201;&#31616;&#27905;&#19968;&#20123;, &#20294;&#31532;&#20108;&#31181;&#22312;&#26576;&#20123;&#26102;&#20505;&#21487;&#33021;&#24456;&#26377;&#29992;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#27604;&#22914;&#20320;&#23450;&#20041;&#20102;&#33258;&#24049;&#30340; ABC &#30340;&#26102;&#20505;&#65292; &#22914; PrintableType</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Register Python's types</span>
PrintableType.register(<span style="font-weight: bold;">int</span>)
PrintableType.register(<span style="font-weight: bold;">float</span>)
PrintableType.register(<span style="font-weight: bold;">str</span>)
</pre>
</div>

<p>
如果要检查一个类是否支持某个接口, 可以这样做:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">func</span>(d):
    <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">isinstance</span>(d, collections.MutableMapping):
        <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span>(<span style="font-style: italic;">"Mapping object expected, not %r"</span> % d)
</pre>
</div>

<p>
当然, 你不必时时刻刻进行类型检查, 只需要在必须的时候做好这一点即可.
</p>

<p>
你可以使用 <code>abc.ABCMeta</code> 作为类定义中的元类来编写自己的ABCs:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> abc <span style="font-weight: bold;">import</span> ABCMeta, abstractmethod

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Drawable</span>():
    <span style="font-weight: bold; font-style: italic;">__metaclass__</span> = ABCMeta

    <span style="font-weight: bold; text-decoration: underline;">@abstractmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">draw</span>(<span style="font-weight: bold;">self</span>, x, y, scale=1.0):
        <span style="font-weight: bold;">pass</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">draw_doubled</span>(<span style="font-weight: bold;">self</span>, x, y):
        <span style="font-weight: bold;">self</span>.draw(x, y, scale=2.0)


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Square</span>(Drawable):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">draw</span>(<span style="font-weight: bold;">self</span>, x, y, scale):
        ...
</pre>
</div>

<p>
由装饰器 <code>@abstractmethod</code> 修饰的方法在子类继承的时候必须实现, 如 <code>draw</code>.
而 <code>draw_double</code> 并不需要.
</p>

<p>
抽象的属性通过 <code>@abstractproperty</code> 实现.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> abc <span style="font-weight: bold;">import</span> abstractproperty
...

<span style="font-weight: bold; text-decoration: underline;">@abstractproperty</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">readonly</span>(<span style="font-weight: bold;">self</span>):
   <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>._x
</pre>
</div>

<p>
ps: 亏得我一直以为python没有这个功能&#x2026;.
</p></li>

<li><p>
<b>Integer Literal Support and Syntax</b>
</p>

<p>
来自 <code>3.0</code> 版本的变化, <code>2.6</code> 版本支持 <code>0o</code> 和 <code>0b</code> 作为前导字符的 八进制和二进制数字.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; 0o21, 2*8 + 1
(17, 17)
&gt;&gt;&gt; 0b101111
47

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20869;&#24314;&#20989;&#25968; 0ct() &#20173;&#28982;&#36820;&#22238;&#21069;&#23548; 0 &#30340;&#23383;&#31526;.</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26032;&#22686;&#20869;&#24314;&#20989;&#25968; bin() &#36820;&#22238;&#20108;&#36827;&#21046;&#20018;.</span>

&gt;&gt;&gt; <span style="font-weight: bold;">oct</span>(42)
<span style="font-style: italic;">'052'</span>
&gt;&gt;&gt; future_builtins.<span style="font-weight: bold;">oct</span>(42)
<span style="font-style: italic;">'0o52'</span>
&gt;&gt;&gt; <span style="font-weight: bold;">bin</span>(173)
<span style="font-style: italic;">'0b10101101'</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20989;&#25968; int() &#21644; long() &#24320;&#22987;&#25903;&#25345; '0o' &#20010; '0b' &#24320;&#22836;&#30340;&#23383;&#31526;&#20018;.</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#25110;&#32773;&#21363;&#20415;&#21442;&#25968;&#20026; 0 &#30340;&#26102;&#20505;(&#34920;&#31034;&#25152;&#20351;&#29992;&#30340;&#22522;&#25968;&#20174;&#23383;&#31526;&#20018;&#30830;&#23450;)</span>

&gt;&gt;&gt; <span style="font-weight: bold;">int</span> (<span style="font-style: italic;">'0o52'</span>, 0)
42
&gt;&gt;&gt; <span style="font-weight: bold;">int</span>(<span style="font-style: italic;">'1101'</span>, 2)
13
&gt;&gt;&gt; <span style="font-weight: bold;">int</span>(<span style="font-style: italic;">'0b1101'</span>, 2)
13
&gt;&gt;&gt; <span style="font-weight: bold;">int</span>(<span style="font-style: italic;">'0b1101'</span>, 0)
13
</pre>
</div></li>

<li><p>
<b>Class Decorators</b>
</p>

<p>
类装饰器 ?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; text-decoration: underline;">@foo</span>
<span style="font-weight: bold; text-decoration: underline;">@bar</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">A</span>:
  <span style="font-weight: bold;">pass</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#31561;&#20215;&#20110;:</span>

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">A</span>:
  <span style="font-weight: bold;">pass</span>

<span style="font-weight: bold; font-style: italic;">A</span> = foo(bar(A))
</pre>
</div></li>

<li><p>
<b>A Type Hierarchy for Numbers</b>
</p>

<p>
数字类型的继承关系:
</p>

<pre class="example">
Number  -- 基类
`-- Complex  -- 继承自 Number, 代表复数类
    `-- Real -- 继承自 Complex, 代表实数类
        `-- Rational -- 继承自 Real, 代表有理数类(可以被转化为 floats)
            `-- Integral -- 继承自 Rational, 代表整数类, 支持 &lt;&lt;, &gt;&gt;, |, &amp; 运算
</pre>

<p>
额, 厉害 ！
</p>

<ul class="org-ul">
<li><p>
<b>The fractions Module</b>
</p>

<p>
<code>2.6</code> 版本新增了 <code>fractions</code> 模块来更好的表示有理数. 这需要用到这个模块的
<code>Fraction</code> 类.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold;">from</span> fractions <span style="font-weight: bold;">import</span> Fraction
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">a</span> = Fraction(2, 3)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">b</span> = Fraction(2, 5)
&gt;&gt;&gt; <span style="font-weight: bold;">float</span>(a), <span style="font-weight: bold;">float</span>(b)
(0.66666666666666663, 0.40000000000000002)
&gt;&gt;&gt; a+b
Fraction(16, 15)
&gt;&gt;&gt; a/b
Fraction(5, 3)
</pre>
</div>

<p>
另外可以通过 <code>as_integer_ratio()</code> 方法将浮点数转化为有理数.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; (2.5) .as_integer_ratio()
(5, 2)
&gt;&gt;&gt; (3.1415) .as_integer_ratio()
(7074029114692207L, 2251799813685248L)
&gt;&gt;&gt; (1./3) .as_integer_ratio()
(6004799503160661L, 18014398509481984L)
</pre>
</div>

<p>
注意第三个例子, 这个函数的转化是通过近似的值来完成的(不是近似的样子)
</p></li>
</ul></li>
</ol>
</div>
</div>
