2018/python2.5-2.7.org
** 核心语言变化
   以下是python核心语言的小变动.

   + 包含 =__main__.py= 的目录或 zip archives 现在可以直接将其名字传递给解释器执行了.
     其路径将会直接插入 =sys.path=.
   
   + =hasattr()= 现在捕获并忽略所有的错误.
     
   + 使用 =**= 提供关键字参数的时候, 不需要在使用python字典, 任何 =映射= 都将工作.

     #+BEGIN_SRC python
       >>> def f(**kw):
       ...    print sorted(kw)
       ...
       >>> ud=UserDict.UserDict()
       >>> ud['a'] = 1
       >>> ud['b'] = 'string'
       >>> f(**ud)
       ['a', 'b']
     #+END_SRC

     另外, 这样写是合法的了:
     
     #+BEGIN_SRC python
       >>> def f(*args, **kw):
       ...     print args, kw
       ...
       >>> f(1,2,3, *(4,5,6), keyword=13)
       (1, 2, 3, 4, 5, 6) {'keyword': 13}
     #+END_SRC

     ..., 这样写没毛病.

   + 新的内建 =next(iterator, [default]=, 当迭代器耗尽的时候, =default= 将被返回.
     如果 =default= 没有定义, 将会出现 =StopIteration= 异常.

   + 元组现在有了 =index()= 和 =count()= 方法.

   + 内建类型的切片操作支持 =(start, stop, step)= 的任意组合.

   + 属性(Properties) 现在有三个 属性(attributes). =getter, setter, deleter=, 它们是装饰器.

     #+BEGIN_SRC python
       class C(object):
           @property
           def x(self):
               return self._x

           @x.setter
           def x(self, value):
               self._x = value

           @x.deleter
           def x(self):
               del self._x

       class D(C):
           @C.x.getter
           def x(self):
               return self._x * 2

           @x.setter
           def x(self, value):
               self._x = value / 2
     #+END_SRC

   + 内置类型 =set= 的几个方法现在接受多个迭代. =intersection(), intersection_update(), union(), update(), difference()= 和 =difference_update()=

     #+BEGIN_SRC python
       >>> s=set('1234567890')
       >>> s.intersection('abc123', 'cdf246')  # Intersection between all inputs
       set(['2'])
       >>> s.difference('246', '789')
       set(['1', '0', '3', '5'])
     #+END_SRC

   + 在支持 =+0= 和 =-0= 的系统上创建复数时, =complex()= 的构造器将保留 =0= 的符号.

   + 从父类继承 =__hash__()= 方法的类可以设置 =__hash__ = None= 来指示该类不可散列.

   + 生成器对象现在有了 =gi_code= 属性, 引用支持生成器的原始代码对象

   + 内建函数 =compile()= 现在支持关键字参数和位置参数.

   + =complex()= 构造函数现在支持带括号的复杂的表达式.

   + 字符串的 =translate()= 现在支持 =None= 作为参数.

   + 内建函数 =dir()= 现在检查接受对象的 =__dir__()= 方法. 此方法必须返回包含该对象的有效属性名称的字符串列表，并让该对象控制 =dir()= 生成的值.

   + 当你在一个类语句中使用 =locals()= 函数时，结果字典不再返回自由变量.

   [[https://docs.python.org/2/whatsnew/2.6.html#interpreter-changes][more...]]

** 其他内容
   同上, 文档链接:
   [[https://docs.python.org/2/whatsnew/2.6.html#new-and-improved-modules][新增和改进模块]], [[https://docs.python.org/2/whatsnew/2.6.html#deprecations-and-removals][弃用和移除]], [[https://docs.python.org/2/whatsnew/2.6.html#build-and-c-api-changes][Python 构建过程和 C API 的变化]] ...

* Python2.7
  终于 =2.7= 了...

  =2.7= 是 =2.x= 的最后一个版本, 如同 =2.6=, =2.7= 也包含了一部分 =3.x= 版本的功能.
  而 =2.7= 某种程度上对应于 =3.1= 版本.

** 主要变化之前
   官方文档在正式讲解 =2.7= 版本的新功能前, 还讲了一些其他的东西 !
   如果你有兴趣的话, 可以看一看:

   [[https://docs.python.org/2/whatsnew/2.7.html#the-future-for-python-2-x][The Future for Python 2.x]]

   [[https://docs.python.org/2/whatsnew/2.7.html#changes-to-the-handling-of-deprecation-warnings][Changes to the Handling of Deprecation Warnings]]

   [[https://docs.python.org/2/whatsnew/2.7.html#python-3-1-features][Python 3.1 Features]]

   PS: 写程序的时候尽可能的考虑与 =3.x= 版本兼容吧 !

