2018/python2.5-2.7.html

<div id="outline-container-org953413f" class="outline-3">
<h3 id="org953413f"><span class="section-number-3">3.2</span> 核心语言变化</h3>
<div class="outline-text-3" id="text-3-2">
<p>
以下是python核心语言的小变动.
</p>

<ul class="org-ul">
<li>包含 <code>__main__.py</code> 的目录或 zip archives 现在可以直接将其名字传递给解释器执行了.
其路径将会直接插入 <code>sys.path</code>.</li>

<li><code>hasattr()</code> 现在捕获并忽略所有的错误.</li>

<li><p>
使用 <code>**</code> 提供关键字参数的时候, 不需要在使用python字典, 任何 <code>映射</code> 都将工作.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">f</span>(**kw):
...    <span style="font-weight: bold;">print</span> <span style="font-weight: bold;">sorted</span>(kw)
...
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">ud</span>=UserDict.UserDict()
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">ud</span>[<span style="font-style: italic;">'a'</span>] = 1
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">ud</span>[<span style="font-style: italic;">'b'</span>] = <span style="font-style: italic;">'string'</span>
&gt;&gt;&gt; f(**ud)
[<span style="font-style: italic;">'a'</span>, <span style="font-style: italic;">'b'</span>]
</pre>
</div>

<p>
另外, 这样写是合法的了:
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">f</span>(*args, **kw):
...     <span style="font-weight: bold;">print</span> args, kw
...
&gt;&gt;&gt; f(1,2,3, *(4,5,6), keyword=13)
(1, 2, 3, 4, 5, 6) {<span style="font-style: italic;">'keyword'</span>: 13}
</pre>
</div>

<p>
&#x2026;, 这样写没毛病.
</p></li>

<li>新的内建 <code>next(iterator, [default]</code>, 当迭代器耗尽的时候, <code>default</code> 将被返回.
如果 <code>default</code> 没有定义, 将会出现 <code>StopIteration</code> 异常.</li>

<li>元组现在有了 <code>index()</code> 和 <code>count()</code> 方法.</li>

<li>内建类型的切片操作支持 <code>(start, stop, step)</code> 的任意组合.</li>

<li><p>
属性(Properties) 现在有三个 属性(attributes). <code>getter, setter, deleter</code>, 它们是装饰器.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">C</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold; text-decoration: underline;">@property</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">x</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>._x

    <span style="font-weight: bold; text-decoration: underline;">@x.setter</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">x</span>(<span style="font-weight: bold;">self</span>, value):
        <span style="font-weight: bold;">self</span>._x = value

    <span style="font-weight: bold; text-decoration: underline;">@x.deleter</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">x</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">del</span> <span style="font-weight: bold;">self</span>._x

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">D</span>(C):
    <span style="font-weight: bold; text-decoration: underline;">@C.x.getter</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">x</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>._x * 2

    <span style="font-weight: bold; text-decoration: underline;">@x.setter</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">x</span>(<span style="font-weight: bold;">self</span>, value):
        <span style="font-weight: bold;">self</span>._x = value / 2
</pre>
</div></li>

<li><p>
内置类型 <code>set</code> 的几个方法现在接受多个迭代. <code>intersection(), intersection_update(), union(), update(), difference()</code> 和 <code>difference_update()</code>
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">s</span>=<span style="font-weight: bold;">set</span>(<span style="font-style: italic;">'1234567890'</span>)
&gt;&gt;&gt; s.intersection(<span style="font-style: italic;">'abc123'</span>, <span style="font-style: italic;">'cdf246'</span>)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Intersection between all inputs</span>
<span style="font-weight: bold;">set</span>([<span style="font-style: italic;">'2'</span>])
&gt;&gt;&gt; s.difference(<span style="font-style: italic;">'246'</span>, <span style="font-style: italic;">'789'</span>)
<span style="font-weight: bold;">set</span>([<span style="font-style: italic;">'1'</span>, <span style="font-style: italic;">'0'</span>, <span style="font-style: italic;">'3'</span>, <span style="font-style: italic;">'5'</span>])
</pre>
</div></li>

<li>在支持 <code>+0</code> 和 <code>-0</code> 的系统上创建复数时, <code>complex()</code> 的构造器将保留 <code>0</code> 的符号.</li>

<li>从父类继承 <code>__hash__()</code> 方法的类可以设置 <code>__hash__ = None</code> 来指示该类不可散列.</li>

<li>生成器对象现在有了 <code>gi_code</code> 属性, 引用支持生成器的原始代码对象</li>

<li>内建函数 <code>compile()</code> 现在支持关键字参数和位置参数.</li>

<li><code>complex()</code> 构造函数现在支持带括号的复杂的表达式.</li>

<li>字符串的 <code>translate()</code> 现在支持 <code>None</code> 作为参数.</li>

<li>内建函数 <code>dir()</code> 现在检查接受对象的 <code>__dir__()</code> 方法. 此方法必须返回包含该对象的有效属性名称的字符串列表，并让该对象控制 <code>dir()</code> 生成的值.</li>

<li>当你在一个类语句中使用 <code>locals()</code> 函数时，结果字典不再返回自由变量.</li>
</ul>

<p>
<a href="https://docs.python.org/2/whatsnew/2.6.html#interpreter-changes">more&#x2026;</a>
</p>
</div>
</div>

<div id="outline-container-orgdaa8020" class="outline-3">
<h3 id="orgdaa8020"><span class="section-number-3">3.3</span> 其他内容</h3>
<div class="outline-text-3" id="text-3-3">
<p>
同上, 文档链接:
<a href="https://docs.python.org/2/whatsnew/2.6.html#new-and-improved-modules">新增和改进模块</a>, <a href="https://docs.python.org/2/whatsnew/2.6.html#deprecations-and-removals">弃用和移除</a>, <a href="https://docs.python.org/2/whatsnew/2.6.html#build-and-c-api-changes">Python 构建过程和 C API 的变化</a> &#x2026;
</p>
</div>
</div>
</div>

<div id="outline-container-org4813c6e" class="outline-2">
<h2 id="org4813c6e"><span class="section-number-2">4</span> Python2.7</h2>
<div class="outline-text-2" id="text-4">
<p>
终于 <code>2.7</code> 了&#x2026;
</p>

<p>
<code>2.7</code> 是 <code>2.x</code> 的最后一个版本, 如同 <code>2.6</code>, <code>2.7</code> 也包含了一部分 <code>3.x</code> 版本的功能.
而 <code>2.7</code> 某种程度上对应于 <code>3.1</code> 版本.
</p>
</div>

<div id="outline-container-orgc067496" class="outline-3">
<h3 id="orgc067496"><span class="section-number-3">4.1</span> 主要变化之前</h3>
<div class="outline-text-3" id="text-4-1">
<p>
官方文档在正式讲解 <code>2.7</code> 版本的新功能前, 还讲了一些其他的东西 !
如果你有兴趣的话, 可以看一看:
</p>

<p>
<a href="https://docs.python.org/2/whatsnew/2.7.html#the-future-for-python-2-x">The Future for Python 2.x</a>
</p>

<p>
<a href="https://docs.python.org/2/whatsnew/2.7.html#changes-to-the-handling-of-deprecation-warnings">Changes to the Handling of Deprecation Warnings</a>
</p>

<p>
<a href="https://docs.python.org/2/whatsnew/2.7.html#python-3-1-features">Python 3.1 Features</a>
</p>

<p>
PS: 写程序的时候尽可能的考虑与 <code>3.x</code> 版本兼容吧 !
</p>
</div>
</div>
