2018/python2.5-2.7.org
** 主要语言变化
   1. *Adding an Ordered Dictionary to collections*

      居然有有序字典, 之前就在想要是有有序字典多好...

      有序字典类 =OrderedDict= 位于 =collections= 模块. 简单使用如下:

      #+BEGIN_SRC python
        >>> from collections import OrderedDict
        >>> d = OrderedDict([('first', 1),
        ...                  ('second', 2),
        ...                  ('third', 3)])
        >>> d.items()
        [('first', 1), ('second', 2), ('third', 3)]
      #+END_SRC

      需要注意的是, 有序字典的排序依据是一个键的插入时间. 插入越早, 排名越前.

      #+BEGIN_SRC python
        # 更改键的值位置保持不变
        >>> d['second'] = 4
        >>> d.items()
        [('first', 1), ('second', 4), ('third', 3)]

        # 删除一个键又重新插入会改变顺序
        >>> del d['second']
        >>> d['second'] = 5
        >>> d.items()
        [('first', 1), ('third', 3), ('second', 5)]
      #+END_SRC

      另外, =popitem()= 方法将会默认返回最后一个元素, 如果设置 =last= 参数为 =False= 的
      话, 将从头开始返回元素.

      #+BEGIN_SRC python
        >>> od = OrderedDict([(x,0) for x in range(20)])
        >>> od.popitem()
        (19, 0)
        >>> od.popitem()
        (18, 0)
        >>> od.popitem(last=False)
        (0, 0)
        >>> od.popitem(last=False)
        (1, 0)
      #+END_SRC

      比较两个字典的话, 如果是两个有序字典相比较, 这必须保证 =键值= 及 =顺序= 都一样才为相等.
      如果是 一个有序字典 和 一个普通字典, 那么保证 =键值= 相同即可.

      #+BEGIN_SRC python
        >>> od1 = OrderedDict([('first', 1),
        ...                    ('second', 2),
        ...                    ('third', 3)])
        >>> od2 = OrderedDict([('third', 3),
        ...                    ('first', 1),
        ...                    ('second', 2)])
        >>> od1 == od2
        False
        >>> # Move 'third' key to the end
        >>> del od2['third']; od2['third'] = 3
        >>> od1 == od2
        True
      #+END_SRC

      [[https://www.python.org/dev/peps/pep-0372][more...]]

   2. *Format Specifier for Thousands Separator*

      为了让我们的程序的输出更美观, =str.format()= 支持通过这种方式来输出更好看的数字:

      #+BEGIN_SRC python
        # 浮点数, 在宽度和精度之间加个 ',' 号
        >>> '{:20,.2f}'.format(18446744073709551616.0)
        '18,446,744,073,709,551,616.00'

        # 整数, 在宽度后面加个 ',' 号.
        >>> '{:20,d}'.format(18446744073709551616)
        '18,446,744,073,709,551,616'
      #+END_SRC

   3. *The argparse Module for Parsing Command Lines*

      在 =2.7= 版本之前, 你可以使用 =getopt()= 和 =optparse= 来接受和处理命令行参数.

      现在, =python= 在此添加了一个名为 =argparse= 的模块, 这个模块同样用于处理命令行参数.
      用法和 =optparse= 类似, 但功能更加强大.(意思就是前段时间刚学的 =optparse= 可以换了...)

      #+BEGIN_SRC python
        import argparse

        parser = argparse.ArgumentParser(description='Command-line example.')

        # Add optional switches
        parser.add_argument('-v', action='store_true', dest='is_verbose',
                            help='produce verbose output')
        parser.add_argument('-o', action='store', dest='output',
                            metavar='FILE',
                            help='direct output to FILE instead of stdout')
        parser.add_argument('-C', action='store', type=int, dest='context',
                            metavar='NUM', default=0,
                            help='display NUM lines of added context')

        # Allow any number of additional arguments.
        parser.add_argument(nargs='*', action='store', dest='inputs',
                            help='input filenames (default is stdin)')

        args = parser.parse_args()
        print args.__dict__
      #+END_SRC

      和 =optparse= 一样, =-h, --help= 指令会自动添加.

      [[https://www.python.org/dev/peps/pep-0389][more...]]

   4. *Dictionary-Based Configuration For Logging*

      日志的打印是一个问题. 日志打印的配置也同样是一个问题. =2.7= 版本开始 =logging= 模块便可以通过
      =dictConfig= 函数设置日志打印. 例:

      #+BEGIN_SRC python
        import logging
        import logging.config

        configdict = {
         'version': 1,    # Configuration schema in use; must be 1 for now
         'formatters': {
             'standard': {
                 'format': ('%(asctime)s %(name)-15s '
                            '%(levelname)-8s %(message)s')}},

         'handlers': {'netlog': {'backupCount': 10,
                             'class': 'logging.handlers.RotatingFileHandler',
                             'filename': '/logs/network.log',
                             'formatter': 'standard',
                             'level': 'INFO',
                             'maxBytes': 1000000},
                      'syslog': {'class': 'logging.handlers.SysLogHandler',
                                 'formatter': 'standard',
                                 'level': 'ERROR'}},

         # Specify all the subordinate loggers
         'loggers': {
                     'network': {
                                 'handlers': ['netlog']
                     }
         },
         # Specify properties of the root logger
         'root': {
                  'handlers': ['syslog']
         },
        }

        # Set up configuration
        logging.config.dictConfig(configdict)

        # As an example, log two error messages
        logger = logging.getLogger('/')
        logger.error('Database not found')

        netlogger = logging.getLogger('network')
        netlogger.error('Connection failed')
      #+END_SRC

      额, 详细的配置方法还是看文档吧: [[https://docs.python.org/2/library/logging.config.html#logging-config-api][logging-configuration]]

   5. *Dictionary Views*

      由于在 =3.x= 版本 =dict()= 的 =keys()=, =values()=, =items()= 返回一个名为视图(view)的对象，而不是完全的列表.

      所以为了向 =3.x= 版本兼容, 同时又不至于修改大量的核心代码, =2.7= 的 =dict= 添加了 =viewkeys()=, =viewvalues()=, =viewitems()=
      三个方法.

      =view= 可以迭代, 但是 *键* 和 *值* 视图也可以使用类似于 *集合(set)* 的 =&= 和 =|= 操作.

      #+BEGIN_SRC python
        >>> d = dict((i*10, chr(65+i)) for i in range(26))
        >>> d
        {0: 'A', 130: 'N', 10: 'B', 140: 'O', 20: ..., 250: 'Z'}
        >>> d.viewkeys()
        dict_keys([0, 130, 10, 140, 20, 150, 30, ..., 250])


        >>> d1 = dict((i*10, chr(65+i)) for i in range(26))
        >>> d2 = dict((i**.5, i) for i in range(1000))
        >>> d1.viewkeys() & d2.viewkeys()
        set([0.0, 10.0, 20.0, 30.0])
        >>> d1.viewkeys() | range(0, 30)
        set([0, 1, 130, 3, 4, 5, 6, ..., 120, 250])
      #+END_SRC

      视图的内容跟随字典变化而变化, 然而你并不能通过更改视图来更改字典...(咋那么像数据库呢...)

      #+BEGIN_SRC python
        # 更改字典改变视图
        >>> vk = d.viewkeys()
        >>> vk
        dict_keys([0, 130, 10, ..., 250])
        >>> d[260] = '&'
        >>> vk
        dict_keys([0, 130, 260, 10, ..., 250])

        # 更改视图发生错误
        >>> for k in vk:
        ...     d[k*2] = k
        ...
        Traceback (most recent call last):
          File "<stdin>", line 1, in <module>
        RuntimeError: dictionary changed size during iteration
      #+END_SRC

      PS: =3.x= 版本的 =keys()=, =values()=, =items()= 默认返回的就是视图.

   6. *The memoryview Object*

      =memoryview= 对象提供了与字节类型的接口相匹配的另一个对象的 *内存内容* 的 *视图*.

      #+BEGIN_SRC python
        >>> import string
        >>> m = memoryview(string.letters)
        >>> m
        <memory at 0x37f850>
        >>> len(m)           # Returns length of underlying object
        52
        >>> m[0], m[25], m[26]   # Indexing returns one byte
        ('a', 'z', 'A')
        >>> m2 = m[0:26]         # Slicing returns another memoryview
        >>> m2
        <memory at 0x37f080>
      #+END_SRC

      视图的内容可以被转换成一个 *字节串* 或一个 *整数列表*:

      #+BEGIN_SRC python
        >>> m2.tobytes()
        'abcdefghijklmnopqrstuvwxyz'
        >>> m2.tolist()
        [97, 98, 99, 100, 101, 102, 103, ... 121, 122]
        >>>
      #+END_SRC

      =memoryview= 对象允许修改底层对象，如果它是一个可变的对象.

      #+BEGIN_SRC python
        >>> m2[0] = 75
        Traceback (most recent call last):
          File "<stdin>", line 1, in <module>
        TypeError: cannot modify read-only memory
        >>> b = bytearray(string.letters)  # Creating a mutable object
        >>> b
        bytearray(b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ')
        >>> mb = memoryview(b)
        >>> mb[0] = '*'         # Assign to view, changing the bytearray.
        >>> b[0:5]              # The bytearray has been changed.
        bytearray(b'*bcde')
        >>>
      #+END_SRC

      PS: 你可以通过视图的 =readonly= 属性来判断它是否是可以更改的.

