2018/python2.5-2.7.html

<div id="outline-container-org2724c91" class="outline-3">
<h3 id="org2724c91"><span class="section-number-3">4.2</span> 主要语言变化</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li><p>
<b>Adding an Ordered Dictionary to collections</b>
</p>

<p>
居然有有序字典, 之前就在想要是有有序字典多好&#x2026;
</p>

<p>
有序字典类 <code>OrderedDict</code> 位于 <code>collections</code> 模块. 简单使用如下:
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold;">from</span> collections <span style="font-weight: bold;">import</span> OrderedDict
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = OrderedDict([(<span style="font-style: italic;">'first'</span>, 1),
                     ...                  (<span style="font-style: italic;">'second'</span>, 2),
                     ...                  (<span style="font-style: italic;">'third'</span>, 3)])
&gt;&gt;&gt; d.items()
[(<span style="font-style: italic;">'first'</span>, 1), (<span style="font-style: italic;">'second'</span>, 2), (<span style="font-style: italic;">'third'</span>, 3)]
</pre>
</div>

<p>
需要注意的是, 有序字典的排序依据是一个键的插入时间. 插入越早, 排名越前.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26356;&#25913;&#38190;&#30340;&#20540;&#20301;&#32622;&#20445;&#25345;&#19981;&#21464;</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span>[<span style="font-style: italic;">'second'</span>] = 4
&gt;&gt;&gt; d.items()
[(<span style="font-style: italic;">'first'</span>, 1), (<span style="font-style: italic;">'second'</span>, 4), (<span style="font-style: italic;">'third'</span>, 3)]

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21024;&#38500;&#19968;&#20010;&#38190;&#21448;&#37325;&#26032;&#25554;&#20837;&#20250;&#25913;&#21464;&#39034;&#24207;</span>
&gt;&gt;&gt; <span style="font-weight: bold;">del</span> d[<span style="font-style: italic;">'second'</span>]
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span>[<span style="font-style: italic;">'second'</span>] = 5
&gt;&gt;&gt; d.items()
[(<span style="font-style: italic;">'first'</span>, 1), (<span style="font-style: italic;">'third'</span>, 3), (<span style="font-style: italic;">'second'</span>, 5)]
</pre>
</div>

<p>
另外, <code>popitem()</code> 方法将会默认返回最后一个元素, 如果设置 <code>last</code> 参数为 <code>False</code> 的
话, 将从头开始返回元素.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">od</span> = OrderedDict([(x,0) <span style="font-weight: bold;">for</span> x <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(20)])
&gt;&gt;&gt; od.popitem()
(19, 0)
&gt;&gt;&gt; od.popitem()
(18, 0)
&gt;&gt;&gt; od.popitem(last=<span style="font-weight: bold; text-decoration: underline;">False</span>)
(0, 0)
&gt;&gt;&gt; od.popitem(last=<span style="font-weight: bold; text-decoration: underline;">False</span>)
(1, 0)
</pre>
</div>

<p>
比较两个字典的话, 如果是两个有序字典相比较, 这必须保证 <code>键值</code> 及 <code>顺序</code> 都一样才为相等.
如果是 一个有序字典 和 一个普通字典, 那么保证 <code>键值</code> 相同即可.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">od1</span> = OrderedDict([(<span style="font-style: italic;">'first'</span>, 1),
                       ...                    (<span style="font-style: italic;">'second'</span>, 2),
                       ...                    (<span style="font-style: italic;">'third'</span>, 3)])
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">od2</span> = OrderedDict([(<span style="font-style: italic;">'third'</span>, 3),
                       ...                    (<span style="font-style: italic;">'first'</span>, 1),
                       ...                    (<span style="font-style: italic;">'second'</span>, 2)])
&gt;&gt;&gt; od1 == od2
<span style="font-weight: bold; text-decoration: underline;">False</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Move 'third' key to the end</span>
&gt;&gt;&gt; <span style="font-weight: bold;">del</span> od2[<span style="font-style: italic;">'third'</span>]; <span style="font-weight: bold; font-style: italic;">od2</span>[<span style="font-style: italic;">'third'</span>] = 3
&gt;&gt;&gt; od1 == od2
<span style="font-weight: bold; text-decoration: underline;">True</span>
</pre>
</div>

<p>
<a href="https://www.python.org/dev/peps/pep-0372">more&#x2026;</a>
</p></li>

<li><p>
<b>Format Specifier for Thousands Separator</b>
</p>

<p>
为了让我们的程序的输出更美观, <code>str.format()</code> 支持通过这种方式来输出更好看的数字:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#28014;&#28857;&#25968;, &#22312;&#23485;&#24230;&#21644;&#31934;&#24230;&#20043;&#38388;&#21152;&#20010; ',' &#21495;</span>
&gt;&gt;&gt; <span style="font-style: italic;">'{:20,.2f}'</span>.<span style="font-weight: bold;">format</span>(18446744073709551616.0)
<span style="font-style: italic;">'18,446,744,073,709,551,616.00'</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#25972;&#25968;, &#22312;&#23485;&#24230;&#21518;&#38754;&#21152;&#20010; ',' &#21495;.</span>
&gt;&gt;&gt; <span style="font-style: italic;">'{:20,d}'</span>.<span style="font-weight: bold;">format</span>(18446744073709551616)
<span style="font-style: italic;">'18,446,744,073,709,551,616'</span>
</pre>
</div></li>

<li><p>
<b>The argparse Module for Parsing Command Lines</b>
</p>

<p>
在 <code>2.7</code> 版本之前, 你可以使用 <code>getopt()</code> 和 <code>optparse</code> 来接受和处理命令行参数.
</p>

<p>
现在, <code>python</code> 在此添加了一个名为 <code>argparse</code> 的模块, 这个模块同样用于处理命令行参数.
用法和 <code>optparse</code> 类似, 但功能更加强大.(意思就是前段时间刚学的 <code>optparse</code> 可以换了&#x2026;)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> argparse

<span style="font-weight: bold; font-style: italic;">parser</span> = argparse.ArgumentParser(description=<span style="font-style: italic;">'Command-line example.'</span>)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Add optional switches</span>
parser.add_argument(<span style="font-style: italic;">'-v'</span>, action=<span style="font-style: italic;">'store_true'</span>, dest=<span style="font-style: italic;">'is_verbose'</span>,
                    <span style="font-weight: bold;">help</span>=<span style="font-style: italic;">'produce verbose output'</span>)
parser.add_argument(<span style="font-style: italic;">'-o'</span>, action=<span style="font-style: italic;">'store'</span>, dest=<span style="font-style: italic;">'output'</span>,
                    metavar=<span style="font-style: italic;">'FILE'</span>,
                    <span style="font-weight: bold;">help</span>=<span style="font-style: italic;">'direct output to FILE instead of stdout'</span>)
parser.add_argument(<span style="font-style: italic;">'-C'</span>, action=<span style="font-style: italic;">'store'</span>, <span style="font-weight: bold;">type</span>=<span style="font-weight: bold;">int</span>, dest=<span style="font-style: italic;">'context'</span>,
                    metavar=<span style="font-style: italic;">'NUM'</span>, default=0,
                    <span style="font-weight: bold;">help</span>=<span style="font-style: italic;">'display NUM lines of added context'</span>)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Allow any number of additional arguments.</span>
parser.add_argument(nargs=<span style="font-style: italic;">'*'</span>, action=<span style="font-style: italic;">'store'</span>, dest=<span style="font-style: italic;">'inputs'</span>,
                    <span style="font-weight: bold;">help</span>=<span style="font-style: italic;">'input filenames (default is stdin)'</span>)

<span style="font-weight: bold; font-style: italic;">args</span> = parser.parse_args()
<span style="font-weight: bold;">print</span> args.__dict__
</pre>
</div>

<p>
和 <code>optparse</code> 一样, <code>-h, --help</code> 指令会自动添加.
</p>

<p>
<a href="https://www.python.org/dev/peps/pep-0389">more&#x2026;</a>
</p></li>

<li><p>
<b>Dictionary-Based Configuration For Logging</b>
</p>

<p>
日志的打印是一个问题. 日志打印的配置也同样是一个问题. <code>2.7</code> 版本开始 <code>logging</code> 模块便可以通过
<code>dictConfig</code> 函数设置日志打印. 例:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> logging
<span style="font-weight: bold;">import</span> logging.config

<span style="font-weight: bold; font-style: italic;">configdict</span> = {
    <span style="font-style: italic;">'version'</span>: 1,    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Configuration schema in use; must be 1 for now</span>
    <span style="font-style: italic;">'formatters'</span>: {
        <span style="font-style: italic;">'standard'</span>: {
            <span style="font-style: italic;">'format'</span>: (<span style="font-style: italic;">'%(asctime)s %(name)-15s '</span>
                       <span style="font-style: italic;">'%(levelname)-8s %(message)s'</span>)}},

 <span style="font-style: italic;">'handlers'</span>: {<span style="font-style: italic;">'netlog'</span>: {<span style="font-style: italic;">'backupCount'</span>: 10,
                         <span style="font-style: italic;">'class'</span>: <span style="font-style: italic;">'logging.handlers.RotatingFileHandler'</span>,
                         <span style="font-style: italic;">'filename'</span>: <span style="font-style: italic;">'/logs/network.log'</span>,
                         <span style="font-style: italic;">'formatter'</span>: <span style="font-style: italic;">'standard'</span>,
                         <span style="font-style: italic;">'level'</span>: <span style="font-style: italic;">'INFO'</span>,
                         <span style="font-style: italic;">'maxBytes'</span>: 1000000},
              <span style="font-style: italic;">'syslog'</span>: {<span style="font-style: italic;">'class'</span>: <span style="font-style: italic;">'logging.handlers.SysLogHandler'</span>,
                         <span style="font-style: italic;">'formatter'</span>: <span style="font-style: italic;">'standard'</span>,
                         <span style="font-style: italic;">'level'</span>: <span style="font-style: italic;">'ERROR'</span>}},

 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Specify all the subordinate loggers</span>
 <span style="font-style: italic;">'loggers'</span>: {
     <span style="font-style: italic;">'network'</span>: {
         <span style="font-style: italic;">'handlers'</span>: [<span style="font-style: italic;">'netlog'</span>]
     }
 },
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Specify properties of the root logger</span>
 <span style="font-style: italic;">'root'</span>: {
     <span style="font-style: italic;">'handlers'</span>: [<span style="font-style: italic;">'syslog'</span>]
 },
}

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Set up configuration</span>
logging.config.dictConfig(configdict)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">As an example, log two error messages</span>
<span style="font-weight: bold; font-style: italic;">logger</span> = logging.getLogger(<span style="font-style: italic;">'/'</span>)
logger.error(<span style="font-style: italic;">'Database not found'</span>)

<span style="font-weight: bold; font-style: italic;">netlogger</span> = logging.getLogger(<span style="font-style: italic;">'network'</span>)
netlogger.error(<span style="font-style: italic;">'Connection failed'</span>)
</pre>
</div>

<p>
额, 详细的配置方法还是看文档吧: <a href="https://docs.python.org/2/library/logging.config.html#logging-config-api">logging-configuration</a>
</p></li>

<li><p>
<b>Dictionary Views</b>
</p>

<p>
由于在 <code>3.x</code> 版本 <code>dict()</code> 的 <code>keys()</code>, <code>values()</code>, <code>items()</code> 返回一个名为视图(view)的对象，而不是完全的列表.
</p>

<p>
所以为了向 <code>3.x</code> 版本兼容, 同时又不至于修改大量的核心代码, <code>2.7</code> 的 <code>dict</code> 添加了 <code>viewkeys()</code>, <code>viewvalues()</code>, <code>viewitems()</code>
三个方法.
</p>

<p>
<code>view</code> 可以迭代, 但是 <b>键</b> 和 <b>值</b> 视图也可以使用类似于 <b>集合(set)</b> 的 <code>&amp;</code> 和 <code>|</code> 操作.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = <span style="font-weight: bold;">dict</span>((i*10, <span style="font-weight: bold;">chr</span>(65+i)) <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(26))
&gt;&gt;&gt; d
{0: <span style="font-style: italic;">'A'</span>, 130: <span style="font-style: italic;">'N'</span>, 10: <span style="font-style: italic;">'B'</span>, 140: <span style="font-style: italic;">'O'</span>, 20: ..., 250: <span style="font-style: italic;">'Z'</span>}
&gt;&gt;&gt; d.viewkeys()
dict_keys([0, 130, 10, 140, 20, 150, 30, ..., 250])


&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d1</span> = <span style="font-weight: bold;">dict</span>((i*10, <span style="font-weight: bold;">chr</span>(65+i)) <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(26))
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d2</span> = <span style="font-weight: bold;">dict</span>((i**.5, i) <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1000))
&gt;&gt;&gt; d1.viewkeys() &amp; d2.viewkeys()
<span style="font-weight: bold;">set</span>([0.0, 10.0, 20.0, 30.0])
&gt;&gt;&gt; d1.viewkeys() | <span style="font-weight: bold;">range</span>(0, 30)
<span style="font-weight: bold;">set</span>([0, 1, 130, 3, 4, 5, 6, ..., 120, 250])
</pre>
</div>

<p>
视图的内容跟随字典变化而变化, 然而你并不能通过更改视图来更改字典&#x2026;(咋那么像数据库呢&#x2026;)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26356;&#25913;&#23383;&#20856;&#25913;&#21464;&#35270;&#22270;</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">vk</span> = d.viewkeys()
&gt;&gt;&gt; vk
dict_keys([0, 130, 10, ..., 250])
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span>[260] = <span style="font-style: italic;">'&amp;'</span>
&gt;&gt;&gt; vk
dict_keys([0, 130, 260, 10, ..., 250])

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26356;&#25913;&#35270;&#22270;&#21457;&#29983;&#38169;&#35823;</span>
&gt;&gt;&gt; <span style="font-weight: bold;">for</span> k <span style="font-weight: bold;">in</span> vk:
...     <span style="font-weight: bold; font-style: italic;">d</span>[k*2] = k
...
Traceback (most recent call last):
File <span style="font-style: italic;">"&lt;stdin&gt;"</span>, line 1, <span style="font-weight: bold;">in</span> &lt;module&gt;
<span style="font-weight: bold; text-decoration: underline;">RuntimeError</span>: dictionary changed size during iteration
</pre>
</div>

<p>
PS: <code>3.x</code> 版本的 <code>keys()</code>, <code>values()</code>, <code>items()</code> 默认返回的就是视图.
</p></li>

<li><p>
<b>The memoryview Object</b>
</p>

<p>
<code>memoryview</code> 对象提供了与字节类型的接口相匹配的另一个对象的 <b>内存内容</b> 的 <b>视图</b>.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold;">import</span> string
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">m</span> = <span style="font-weight: bold;">memoryview</span>(string.letters)
&gt;&gt;&gt; m
&lt;memory at 0x37f850&gt;
&gt;&gt;&gt; <span style="font-weight: bold;">len</span>(m)           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Returns length of underlying object</span>
52
&gt;&gt;&gt; m[0], m[25], m[26]   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Indexing returns one byte</span>
(<span style="font-style: italic;">'a'</span>, <span style="font-style: italic;">'z'</span>, <span style="font-style: italic;">'A'</span>)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">m2</span> = m[0:26]         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Slicing returns another memoryview</span>
&gt;&gt;&gt; m2
&lt;memory at 0x37f080&gt;
</pre>
</div>

<p>
视图的内容可以被转换成一个 <b>字节串</b> 或一个 <b>整数列表</b>:
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; m2.tobytes()
<span style="font-style: italic;">'abcdefghijklmnopqrstuvwxyz'</span>
&gt;&gt;&gt; m2.tolist()
[97, 98, 99, 100, 101, 102, 103, ... 121, 122]
&gt;&gt;&gt;
</pre>
</div>

<p>
<code>memoryview</code> 对象允许修改底层对象，如果它是一个可变的对象.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">m2</span>[0] = 75
Traceback (most recent call last):
File <span style="font-style: italic;">"&lt;stdin&gt;"</span>, line 1, <span style="font-weight: bold;">in</span> &lt;module&gt;
<span style="font-weight: bold; text-decoration: underline;">TypeError</span>: cannot modify read-only memory
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">b</span> = <span style="font-weight: bold;">bytearray</span>(string.letters)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Creating a mutable object</span>
&gt;&gt;&gt; b
<span style="font-weight: bold;">bytearray</span>(b<span style="font-style: italic;">'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'</span>)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">mb</span> = <span style="font-weight: bold;">memoryview</span>(b)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">mb</span>[0] = <span style="font-style: italic;">'*'</span>         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Assign to view, changing the bytearray.</span>
&gt;&gt;&gt; b[0:5]              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">The bytearray has been changed.</span>
<span style="font-weight: bold;">bytearray</span>(b<span style="font-style: italic;">'*bcde'</span>)
&gt;&gt;&gt;
</pre>
</div>

<p>
PS: 你可以通过视图的 <code>readonly</code> 属性来判断它是否是可以更改的.
</p></li>
</ol>
</div>
</div>
